&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// Пропускаем инициализацию, чтобы гарантировать получение формы при передаче параметра "АвтоТест".
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если Не Параметры.ПринудительныйЗапуск Тогда
		ВызватьИсключение НСтр("ru='Обработка не предназначена для непосредственного использования.'");
	КонецЕсли;
	
	МакетДокумента = Обработки.ЛегальностьПолученияОбновлений.ПолучитьМакет("УсловияРаспространенияОбновлений");
	ТекстПредупреждения = МакетДокумента.ПолучитьТекст();
	ПодтверждениеВыбора = 0;  // пользователю требуется явно выбрать один из вариантов
	ПринудительныйЗапуск = Параметры.ПринудительныйЗапуск;
	Элементы.Примечание.Видимость = Параметры.ПоказыватьПредупреждениеОПерезапуске;
	
КонецПроцедуры

&НаКлиенте
Процедура ОсновныеДействияФормыПродолжить(Команда)
	
	Закрыть(ПодтверждениеВыбора = 1);
	
КонецПроцедуры

