Процедура ЗаполнитьПоУмолчанию(ДатаНачалаВводаДанных) Экспорт
	
	Отбор.Период.Установить(ДатаНачалаВводаДанных);
	
	ПараметрыУчетнойПолитики = Добавить();
	
	ПараметрыУчетнойПолитики.Период                                   = ДатаНачалаВводаДанных;
	ПараметрыУчетнойПолитики.СпособОценкиМПЗ                          = Перечисления.СпособыОценки.ПоСредней;
	ПараметрыУчетнойПолитики.ДетализацияКосвенныхЗатратВСебестоимости = Перечисления.ДетализацияКосвенныхЗатратВСебестоимости.ПоКаждойСтатьеЗатрат;
	ПараметрыУчетнойПолитики.СпособИспользованияНакопительныхСкидок   = Перечисления.СпособыИспользованияНакопительныхСкидок.СкидкиНакапливаютсяПоДисконтнойКарте;
	
	ПараметрыУчетнойПолитики.СпособРасчетаСебестоимостиВыпускаПоОперациям           = Перечисления.СпособыРасчетаСебестоимостиВыпускаПоОперациям.ПоПрямымЗатратам;
	ПараметрыУчетнойПолитики.СпособРасчетаСебестоимостиОсновногоПроизводства        = Перечисления.СпособыРасчетаСебестоимостиПродукции.ПоПеределам;
	ПараметрыУчетнойПолитики.СпособРасчетаСебестоимостиВспомогательногоПроизводства = Перечисления.СпособыРасчетаСебестоимостиПродукции.ПоПеределам;
	
КонецПроцедуры
