// Возвращает код языка интерфейса в формате ru/uk
Функция КодЯзыкаИнтерфейса() Экспорт
	
	Возврат ТекущийЯзык().КодЯзыка;
	
КонецФункции // КодЯзыкаИнтерфейса()

//По коду языка возвращает строку параметров прописи из справочника Валюты 
//(ПараметрыПрописиНаРусском или ПараметрыПрописиНаУкраинском).
Функция ПараметрыПрописи(Валюта, КодЯзыка) Экспорт
	
	Рез = ?(КодЯзыка = "uk",Валюта.ПараметрыПрописиНаУкраинском,Валюта.ПараметрыПрописиНаРусском);
	Если Рез = "" Тогда
		ОбщегоНазначения.СообщитьСлужебнуюИнформацию("Для валюты " + Валюта + " не установлены параметры прописи для кода языка " + КодЯзыка);
	КонецЕсли;
	
	Возврат Рез;
	
КонецФункции // ПараметрыПрописи()

// Возвращает код языка информационной базы, который указан 
// в региональных настройках (в конфигураторе)
Функция КодЯзыкаИнформационнойБазы() Экспорт
	
	// любой язык кроме украинского будем считать русским
	КодЛокализацииИБ = КодЛокализации();
	Возврат ?((КодЛокализацииИБ = "uk_UA") или (КодЛокализацииИБ = "uk"),"uk","ru");
	
КонецФункции // КодЯзыкаИнформационнойБазы()

// Возвращает код языка системы
Функция КодЯзыкаСистемы() Экспорт
	
	// любой язык кроме украинского будем считать русским
	КодЯзыкаСистемы = ТекущийЯзыкСистемы();
	Возврат ?((КодЯзыкаСистемы = "uk_UA") или (КодЯзыкаСистемы = "uk"),"uk","ru");
	
КонецФункции // КодЯзыкаСистемы()

// Функция возвращает имя языка для формирования нерегламентых печатных форм
// документов и некоторых справочников с учетом установленного режима в настройках
// пользователя. По умолчанию это язык информционной базы.
//
// Параметры
//     	РежимПользователя - Установленное значение в настройках пользователя
//
// Возвращаемое значение:
//		Строка   – код языка
//
Функция ПолучитьЯзыкФормированияПечатныхФорм(РежимПользователя = Неопределено) Экспорт

	
	Если РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаРусскомЯзыке Тогда
		
		КодЯзыкаПечать = "ru";
		
	ИначеЕсли РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаУкраинскомЯзыке Тогда
		
		КодЯзыкаПечать = "uk";
		
	ИначеЕсли РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаЯзыкеИнтерфейсаПользователя Тогда		
		
		КодЯзыкаПечать = ЛокализацияПовтИсп.КодЯзыкаИнтерфейса();
		
	Иначе// РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаЯзыкеИнформационнойБазы 
		 // или по - умолчанию
		 
		КодЯзыкаПечать = ЛокализацияПовтИсп.КодЯзыкаИнформационнойБазы();
		
	КонецЕсли;

	Возврат КодЯзыкаПечать;
	
КонецФункции // ПолучитьЯзыкФормированияПечатныхФорм()

// Функция возвращает имя языка для формирования печатных форм документов
// с учетом установленного режима в настройках текущего пользователя. 
// По умолчанию - это язык информационной базы.
//
// Возвращаемое значение:
//		Строка   – код языка
//
Функция ПолучитьЯзыкФормированияПечатныхФормДокументов() Экспорт

	РежимФормированияПечатныхФормДокументов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм");
	
	Если РежимФормированияПечатныхФормДокументов = Перечисления.РежимФормированияПечатныхФорм.НаРусскомЯзыке Тогда
		
		КодЯзыкаПечать = "ru";
		
	ИначеЕсли РежимФормированияПечатныхФормДокументов = Перечисления.РежимФормированияПечатныхФорм.НаУкраинскомЯзыке Тогда
		
		КодЯзыкаПечать = "uk";
		
	ИначеЕсли РежимФормированияПечатныхФормДокументов = Перечисления.РежимФормированияПечатныхФорм.НаЯзыкеИнтерфейсаПользователя Тогда		
		
		КодЯзыкаПечать = ЛокализацияПовтИсп.КодЯзыкаИнтерфейса();
		
	Иначе // РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаЯзыкеИнформационнойБазы 
		  // или по умолчанию
		 
		КодЯзыкаПечать = ЛокализацияПовтИсп.КодЯзыкаИнформационнойБазы();
		
	КонецЕсли;

	Возврат КодЯзыкаПечать;
	
КонецФункции // ПолучитьЯзыкФормированияПечатныхФормДокументов()

// Функция возвращает имя языка для формирования печатных форм отчетов
// с учетом установленного режима в настройках текущего пользователя. 
// По умолчанию - это язык информационной базы.
//
// Возвращаемое значение:
//		Строка   – код языка
//
Функция ПолучитьЯзыкФормированияПечатныхФормОтчетов() Экспорт

	РежимФормированияПечатныхФормОтчетов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "РежимФормированияПечатныхФорм");
	
	Если РежимФормированияПечатныхФормОтчетов = Перечисления.РежимФормированияПечатныхФорм.НаРусскомЯзыке Тогда
		
		КодЯзыкаПечать = "ru";
		
	ИначеЕсли РежимФормированияПечатныхФормОтчетов = Перечисления.РежимФормированияПечатныхФорм.НаУкраинскомЯзыке Тогда
		
		КодЯзыкаПечать = "uk";
		
	ИначеЕсли РежимФормированияПечатныхФормОтчетов = Перечисления.РежимФормированияПечатныхФорм.НаЯзыкеИнтерфейсаПользователя Тогда		
		
		КодЯзыкаПечать = ЛокализацияПовтИсп.КодЯзыкаИнтерфейса();
		
	Иначе // РежимПользователя = Перечисления.РежимФормированияПечатныхФорм.НаЯзыкеИнформационнойБазы 
		  // или по умолчанию
		 
		КодЯзыкаПечать = ЛокализацияПовтИсп.КодЯзыкаИнформационнойБазы();
		
	КонецЕсли;

	Возврат КодЯзыкаПечать;
	
КонецФункции // ПолучитьЯзыкФормированияПечатныхФормОтчетов()

//Преобразует код языка в формат понятный системной фунции Формат()
// Параметры
//  КодЯзыка  	 – Строка – код языка в формате uk/ru
//
// Возвращаемое значение:
//   Строка   	 – код языка в формате ru_RU/uk_UA
//
Функция ОпределитьКодЯзыкаДляФормат(КодЯзыка) Экспорт
	
	Возврат ?(КодЯзыка = "uk","uk_UA","ru_RU");
	
КонецФункции // ОпределитьКодЯзыкаДляФормат()

Функция ОбработатьПереводы(ПолноеИмяОбъектаМетаданных, ИмяДляПеревода, КодЯзыка, СинонимМетаданных = "") Экспорт
	
		Если ПолноеИмяОбъектаМетаданных = "Документ.АвансовыйОтчет" Тогда 
			Возврат НСтр( "ru='Авансовый отчет';uk='Авансовий звіт';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.АктОбОказанииПроизводственныхУслуг" Тогда 
			Возврат НСтр( "ru='Акт об оказании производственных услуг';uk='Акт про надання послуг з виробництва';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВводНачальныхОстатковОС" Тогда 
			Возврат НСтр( "ru='Ввод начальных остатков по ОС';uk='Введення інформації про початкові залишки ОЗ';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВозвратТоваровОтПокупателя" Тогда 
			Возврат НСтр( "ru='Возврат товаров от покупателя';uk='Повернення товарів від покупців';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ВозвратТоваровПоставщику" Тогда 
			Возврат НСтр( "ru='Возврат товаров поставщику';uk='Повернення товарів постачальнику';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ДокументРасчетовСКонтрагентом" Тогда 
			Возврат НСтр( "ru='Документ расчетов с контрагентом (ручной учет)';uk='Документ розрахунків з покупцем (ручний облік)';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаказНаПроизводство" Тогда 	
			Возврат НСтр( "ru='Заказ на производство';uk='Замовлення на виробництво';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаказПокупателя" Тогда 
			Возврат НСтр( "ru='Заказ покупателя';uk='Замовлення покупця';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ЗаказПоставщику" Тогда 
			Возврат НСтр( "ru='Заказ поставщику';uk='Замовлення постачальникові';" ,КодЯзыка);	
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеЗаказаПокупателя" Тогда 
			Возврат НСтр( "ru='Изменение заказа покупателя';uk='Зміна замовлення покупця';" ,КодЯзыка);	
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИзменениеЛимитовОтпускаМатериалов" Тогда 
			Возврат НСтр( "ru='Изменение лимитов отпуска материалов';uk='Зміна лімітів відпуску матеріалів';" ,КодЯзыка);	
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИнвентаризацияНЗП" Тогда 
			Возврат НСтр( "ru='Инвентаризация незавершенного производства';uk='Інвентаризація незавершеного виробництва';" ,КодЯзыка);	
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ИнвентаризацияТоваровНаСкладе" Тогда 
			Возврат НСтр( "ru='Инвентаризация товаров на складе';uk='Інвентаризація товарів на складі';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаДолга" Тогда 
			Возврат НСтр( "ru='Корректировка долга';uk='Коректування боргу';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаЗаказаНаПроизводство" Тогда 
			Возврат НСтр( "ru='Корректировка заказа на производство';uk='Коректування замовлення на виробництво';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.КорректировкаНЗП" Тогда 
			Возврат НСтр( "ru='Корректировка незавершенного производства';uk='Коректування незавершеного виробництва';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОприходованиеМатериаловИзПроизводства" Тогда 
			Возврат НСтр( "ru='Оприходование материалов из производства';uk='Оприбуткування матеріалів із виробництва';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОприходованиеНЗП" Тогда 
			Возврат НСтр( "ru='Оприходование незавершенного производства';uk='Оприбуткування незавершеного виробництва';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОприходованиеТоваров" Тогда 
			Возврат НСтр( "ru='Оприходование товаров';uk='Оприбуткування товарів';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетКомиссионераОПродажах" Тогда 
			Возврат НСтр( "ru='Отчет комиссионера о продажах';uk='Звіт комісіонера про продаж';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетКомитентуОПродажах" Тогда 
			Возврат НСтр( "ru='Отчет комитенту о продажах товаров';uk='Звіт комітенту про продаж';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетМастераСмены" Тогда 
			Возврат НСтр( "ru='Отчет мастера смены';uk='Звіт майстра зміни';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетОРозничныхПродажах" Тогда 
			Возврат НСтр( "ru='Отчет о розничных продажах';uk='Звіт про роздрібний продаж';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетОСоставеСмены" Тогда 
			Возврат НСтр( "ru='Отчет о составе смены';uk='Звіт про склад зміни';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОтчетПроизводстваЗаСмену" Тогда 
			Возврат НСтр( "ru='Отчет производства за смену';uk='Звіт виробництва за зміну';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.Партия" Тогда 
			Возврат НСтр( "ru='Партия (ручной учет)';uk='Партія (ручний облік)';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПартияМалоценкиВЭксплуатации" Тогда 
			Возврат НСтр( "ru='Партия малоценки в эксплуатации (ручной учет)';uk='Партія малоцінки (ручний облік)';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПередачаМалоценкиВЭксплуатацию" Тогда 
			Возврат НСтр( "ru='Передача малоценки в эксплуатацию';uk='Передача малоцінки у експлуатацію';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПередачаОС" Тогда 
			Возврат НСтр( "ru='Передача ОС';uk='Передача ОС ';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПередачаНМА" Тогда 
			Возврат НСтр( "ru='Передача НМА';uk='Передача НМА ';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПлатежноеПоручениеВходящее" Тогда 
			Возврат НСтр( "ru='Платежное поручение входящее';uk='Платіжне доручення отримане';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПлатежноеПоручениеИсходящее" Тогда 
			Возврат НСтр( "ru='Платежное поручение исходящее';uk='Платіжне доручення ';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПлатежныйОрдерПоступлениеДенежныхСредств" Тогда 
			Возврат НСтр( "ru='Платежный ордер, поступление денежных средств';uk='Платіжний ордер, надходження грошових коштів';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПлатежныйОрдерСписаниеДенежныхСредств" Тогда 
			Возврат НСтр( "ru='Платежный ордер, списание денежных средств';uk='Платіжний ордер, списання грошових коштів';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеДопРасходов" Тогда 
			Возврат НСтр( "ru='Поступление доп. расходов';uk='Надходження дод. витрат';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПоступлениеТоваровУслуг" Тогда 
			Возврат НСтр( "ru='Поступление товаров и услуг';uk='Надходження товарів та послуг';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПриходныйКассовыйОрдер" Тогда 
			Возврат НСтр( "ru='Приходный кассовый ордер';uk='Прибутковий касовий ордер';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РасходныйКассовыйОрдер" Тогда 
			Возврат НСтр( "ru='Расходный кассовый ордер';uk='Видатковий касовий ордер';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РеализацияТоваровУслуг" Тогда 
			Возврат НСтр( "ru='Реализация товаров и услуг';uk='Реалізація товарів та послуг';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РеализацияУслугПоПереработке" Тогда 
			Возврат НСтр( "ru='Реализация услуг по переработке';uk='Реалізація послуг з переробки';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СертификацияНоменклатуры" Тогда 
			Возврат НСтр( "ru='Сертификация номенклатуры';uk='Сертифікація номенклатури';" ,КодЯзыка);	
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СчетНаОплатуПокупателю" Тогда 
			Возврат НСтр( "ru='Счет на оплату покупателю';uk='Рахунок на оплату покупцю';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СчетНаОплатуПоставщика" Тогда 
			Возврат НСтр( "ru='Счет на оплату поставщика';uk='Рахунок на оплату постачальника';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПеремещениеТоваров" Тогда 
			Возврат НСтр( "ru='Перемещение товаров';uk='Переміщення товарів';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПередачаТоваров" Тогда 
			Возврат НСтр( "ru='Передача товаров';uk='Передача товарів';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПриходныйОрдерНаТовары" Тогда 
			Возврат НСтр( "ru='Приходный ордер на товары';uk='Прибутковий ордер на товари';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УстановкаПараметровУчетаНоменклатуры" Тогда 
			Возврат НСтр( "ru='Установка параметров учета номенклатуры';uk='Установка параметрів обліку номенклатури';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.УслугиСобственнымПодразделениям" Тогда 
			Возврат НСтр( "ru='Услуги собственным подразделениям';uk='Послуги власним підрозділам';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПланЗакупок" Тогда 
			Возврат НСтр( "ru='План закупок';uk='План закупівель';" ,КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПланПродаж" Тогда 
			Возврат НСтр("ru='План продаж';uk='План продажів';", КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПланПроизводства" Тогда 
			Возврат НСтр("ru='План производства';uk='План виробництва';", КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПланПроизводстваПоСменам" Тогда 
			Возврат НСтр("ru='План производства по сменам';uk='План виробництва по змінах';", КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПрочиеЗатраты" Тогда 
			Возврат НСтр("ru='Прочие затраты';uk='Інші витрати';", КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РазмещениеЗаказа" Тогда 
			Возврат НСтр("ru='Размещение заказа';uk='Розміщення замовлення';", КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.РезервированиеТоваров" Тогда 
			Возврат НСтр("ru='Резервирование товаров';uk='Резервування товарів';", КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ПереоценкаТоваровВРознице" Тогда 
			Возврат НСтр("ru='Переоценка товаров в рознице';uk='Переоцінка товарів у роздробі';", КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.СписаниеНЗП" Тогда 
			Возврат НСтр("ru='Списание незавершенного производства';uk='Списання незавершеного виробництва';", КодЯзыка);
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Документ.ОперацияБух" Тогда 
			Возврат НСтр("ru='Операция (бухгалтерский и налоговый учет)';uk='Операція (бухгалтерський і податковий облік)';", КодЯзыка);
		КонецЕсли;	

		
		Если ПолноеИмяОбъектаМетаданных = "Перечисление.ABCКлассификация" Тогда 
			Если ИмяДляПеревода = "AКласс" Тогда 
				Возврат НСтр( "ru='A - класс';uk='A - клас'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "BКласс" Тогда 
				Возврат НСтр( "ru='B - класс';uk='B - клас'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "CКласс" Тогда 
				Возврат НСтр( "ru='C - класс';uk='C - клас'" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.XYZКлассификация" Тогда 
			Если ИмяДляПеревода = "XКласс" Тогда 
				Возврат НСтр( "ru='X - класс';uk='X - клас'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "YКласс" Тогда 
				Возврат НСтр( "ru='Y - класс';uk='Y - клас'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ZКласс" Тогда 
				Возврат НСтр( "ru='Z - класс';uk='Z - клас'" ,КодЯзыка);			


			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.Важность" Тогда 
			Если ИмяДляПеревода = "Высокая" Тогда 
				Возврат НСтр( "ru='Высокая';uk='Висока'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Низкая" Тогда 
				Возврат НСтр( "ru='Низкая';uk='Низька'" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Средняя" Тогда 
				Возврат НСтр( "ru='Средняя';uk='Середня'" ,КодЯзыка);			
			КонецЕсли;
			
			
			
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПолФизическихЛиц" Тогда 
			Если ИмяДляПеревода = "Женский" Тогда 
				Возврат НСтр( "uk='Жіночий';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Мужской" Тогда 
				Возврат НСтр( "ru='Мужской';uk='Чоловічий';" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СтавкиНДС" Тогда 
			Если ИмяДляПеревода = "БезНДС" Тогда 
				Возврат НСтр( "ru='Без НДС';uk='Без ПДВ';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДС0" Тогда 
				Возврат НСтр( "ru='0%';uk='0%';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДС20" Тогда 
				Возврат НСтр( "ru='20%';uk='20%';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НДС7" Тогда 
				Возврат НСтр( "ru='7%';uk='7%';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеНДС" Тогда 
				Возврат НСтр( "ru='Не НДС';uk='Не ПДВ';" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыСкладов" Тогда 
			Если ИмяДляПеревода = "Оптовый" Тогда 
				Возврат НСтр( "ru='Оптовый';uk='Гуртовий';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Розничный" Тогда 
				Возврат НСтр( "ru='Розничный';uk='Роздрібний';" ,КодЯзыка);			
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыНачисленияАмортизацииОС" Тогда 
			Если ИмяДляПеревода = "Прямолинейный" Тогда 
				Возврат НСтр( "ru='Прямолинейный';uk='Прямолінійний';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Налоговый" Тогда 
				Возврат НСтр( "ru='Налоговый';uk='Податковий';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "УменьшенияОстатка" Тогда 
				Возврат НСтр( "ru='Уменьшения остатка';uk='Зменьшення залишку';" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "Кумулятивный" Тогда 
				Возврат НСтр( "ru='Кумулятивный (по сумме чисел лет)';uk='Кумулятивний (по сумі чисел років)';" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "Производственный" Тогда 
				Возврат НСтр( "ru='Производственный';uk='Виробничий';" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "ПоИндивидуальномуГрафику" Тогда 
				Возврат НСтр( "ru='По индивидуальному графику амортизации';uk='За особистим графіком амортизації';" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "УскоренногоУменьшенияОстатка" Тогда 
				Возврат НСтр( "ru='Ускоренного уменьшения остатка';uk='Прискореного зменшення залишку ';" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "_100" Тогда 
				Возврат НСтр( "ru='100%';uk='100%';" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "_50_50" Тогда 
				Возврат НСтр( "ru='50% - 50%';uk='50% - 50%';" ,КодЯзыка);	
			КонецЕсли;	
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДеятельностиНДС" Тогда 
			Если ИмяДляПеревода = "Облагаемая" Тогда 
				Возврат НСтр( "ru='Облагаемая';uk='Оподатковувана';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Необлагаемая" Тогда 
				Возврат НСтр( "ru='Необлагаемая';uk='Неоподатковувана';" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "ЧастичноОблагаемая" Тогда 
				Возврат НСтр( "ru='Частично облагаемая';uk='Частково оподатковувана';" ,КодЯзыка);	
			КонецЕсли;	
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ХарактерВыплатыПоДоговору" Тогда 
			Если ИмяДляПеревода = "ОднократноВКонцеСрока" Тогда 
				Возврат НСтр( "ru='Однократно в конце срока';uk='Однократно наприкінці терміну';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Ежемесячно" Тогда 
				Возврат НСтр( "ru='Ежемесячно';uk='Щомісяця';" ,КодЯзыка);		
			КонецЕсли;	
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыДенежныхСредств" Тогда 
			Если ИмяДляПеревода = "Наличные" Тогда 
				Возврат НСтр( "ru='Наличные';uk='Готівка';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Безналичные" Тогда 
				Возврат НСтр( "ru='Безналичные';uk='Безготівка';" ,КодЯзыка);		
			КонецЕсли;	
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыДомов" Тогда 
			Если ИмяДляПеревода = "Дом" Тогда 
				Возврат НСтр( "ru='Дом';uk='Будинок';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Владение" Тогда 
				Возврат НСтр( "ru='Владение';uk='Володіння';" ,КодЯзыка);		
			КонецЕсли;				
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыКорпусов" Тогда 
			Если ИмяДляПеревода = "Корпус" Тогда 
				Возврат НСтр( "ru='Корпус';uk='Корпус';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Строение" Тогда 
				Возврат НСтр( "ru='Строение';uk='Cпоруда';" ,КодЯзыка);		
			КонецЕсли;				
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ТипыКвартир" Тогда 
			Если ИмяДляПеревода = "Квартира" Тогда 
				Возврат НСтр( "ru='Квартира';uk='Квартира';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Офис" Тогда 
				Возврат НСтр( "ru='Офис';uk='Офіс';" ,КодЯзыка);		
			КонецЕсли;				


		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ГруппыВоинскогоУчета" Тогда 
			Если ИмяДляПеревода = "НВО" Тогда 
				Возврат НСтр( "ru='НВО';uk='НПО';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВМС" Тогда 
				Возврат НСтр( "ru='ВМС';uk='ВМС';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "МВД" Тогда 
				Возврат НСтр( "ru='МВД';uk='МВС';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "СБУ" Тогда 
				Возврат НСтр( "ru='СБУ';uk='СБУ';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ГПС" Тогда 
				Возврат НСтр( "ru='ГПС';uk='ДПС';" ,КодЯзыка);			
			КонецЕсли;		
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ГодностьКВоеннойСлужбе" Тогда 
			Если ИмяДляПеревода = "Годен" Тогда 
				Возврат НСтр( "ru='Годен к военной службе';uk='Придатний до військової служби';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "НеГоден" Тогда 
				Возврат НСтр( "ru='Не годен к военной службе';uk='Не придатний до військової служби';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ГоденКНестроевой" Тогда 
				Возврат НСтр( "ru='Негоден в мирное время, ограниченно годен в военное время';uk='Непридатний в мирний час, обмежено придатний в воєнний час';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ВременноНегоден" Тогда 
				Возврат НСтр( "ru='Временно негоден';uk='Тимчасово непридатний';" ,КодЯзыка);
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.КатегорииВоинскогоУчета" Тогда 
			Если ИмяДляПеревода = "Первая" Тогда 
				Возврат НСтр( "ru='Первая(ый)';uk='Перша(ий)';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Вторая" Тогда 
				Возврат НСтр( "ru='Вторая(ой)';uk='Друга(ий)';" ,КодЯзыка);
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СоставыВоеннослужащих" Тогда 
			Если ИмяДляПеревода = "Рядовой" Тогда 
				Возврат НСтр( "ru='Рядовой';uk='Рядовий';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "СержантскийИСтаршинский" Тогда 
				Возврат НСтр( "ru='Сержантский и старшинский';uk='Сержантський і старшинський склад';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ПрапорщиковИМичманов" Тогда 
				Возврат НСтр( "ru='Прапорщиков и мичманов';uk='Прапорщиків і мічманів';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "МладшиеОфицеры" Тогда 
				Возврат НСтр( "ru='Младшие офицеры';uk='Молодші офіцери';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "СтаршиеОфицеры" Тогда 
				Возврат НСтр( "ru='Старшие офицеры';uk='Старші офіцери';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ВысшиеОфицеры" Тогда 
				Возврат НСтр( "ru='Высшие офицеры';uk='Вищі офіцери';" ,КодЯзыка);		
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПрофилиОфицеров" Тогда 
			Если ИмяДляПеревода = "Командный" Тогда 
				Возврат НСтр( "ru='Командный';uk='Командний';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Инженерный" Тогда 
				Возврат НСтр( "ru='Инженерный';uk='Інженерний';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Технический" Тогда 
				Возврат НСтр( "ru='Технический';uk='Технічний';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Юридический" Тогда 
				Возврат НСтр( "ru='Юридический';uk='Юридичний';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Медицинский" Тогда 
				Возврат НСтр( "ru='Медицинский';uk='Медичний';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Ветеринарный" Тогда 
				Возврат НСтр( "ru='Ветеринарный';uk='Ветеринарний';" ,КодЯзыка);		
			КонецЕсли;
			
 		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СпособыРасчетаОплатыТруда" Тогда 
			Если ИмяДляПеревода = "АлиментыПроцентом" Тогда 
				Возврат НСтр( "ru='Алименты процентом';uk='Аліменти відсотком';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "АлиментыПроцентомДоПредела" Тогда 
				Возврат НСтр( "ru='Алименты процентом до предела';uk='Аліменти відсотком до межі';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "АлиментыФиксСуммой" Тогда 
				Возврат НСтр( "ru='Алименты фиксированной суммой';uk='Аліменти фіксованою сумою';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "АлиментыФиксСуммойДоПредела" Тогда 
				Возврат НСтр( "ru='Алименты фиксированной суммой до предела';uk='Аліменти фіксованою сумою до межі';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Взносы" Тогда 
				Возврат НСтр( "ru='Взносы';uk='Внески';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Взносы" Тогда 
				Возврат НСтр( "ru='Взносы';uk='Внески';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ВзносыФОТ" Тогда 
				Возврат НСтр( "ru='Взносы ФОТ';uk='Внески ФОП';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ВыслугаЛет" Тогда 
				Возврат НСтр( "ru='Выслуга лет';uk='Вислуга років';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ГосударственноеПособие" Тогда 
				Возврат НСтр( "ru='Государственное пособие';uk='Державна допомога';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ДоплатаДоСреднегоЗаработка" Тогда 
				Возврат НСтр( "ru='Доплата до среднего заработка';uk='Доплата до середнього заробітку';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ДоплатаЗаВечерниеЧасы" Тогда 
				Возврат НСтр( "ru='Доплата за вечерние часы';uk='Доплата за вечірні години';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ДоплатаЗаНочныеЧасы" Тогда 
				Возврат НСтр( "ru='Доплата за ночные часы';uk='Доплата за нічні години';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Замена" Тогда 
				Возврат НСтр( "ru='Замена';uk='Заміна';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ИндексацияЗарплаты" Тогда 
				Возврат НСтр( "ru='Индексация зарплаты';uk='Індексація заробітку';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ИндексацияСоциальныхНачислений" Тогда 
				Возврат НСтр( "ru='Индексация социальных начислений';uk='Індексація соціальних нарахувань';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ИсполнителныйЛистСУчетомОграничения" Тогда 
				Возврат НСтр( "ru='Исполнителный лист с учетом ограничения';uk='Виконавчий лист з урахуванням обмеження';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ИсполнительныйЛистПроцентом" Тогда 
				Возврат НСтр( "ru='Исполнительный лист процентом';uk='Виконавчий лист відсотком';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ИсполнительныйЛистПроцентомДоПредела" Тогда 
				Возврат НСтр( "ru='Исполнительный лист процентом до предела';uk='Виконавчий лист відсотком до межі';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ИсполнительныйЛистФиксСуммой" Тогда 
				Возврат НСтр( "ru='Исполнительный лист фиксированной суммой';uk='Виконавчий лист фіксованою сумою';" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "ИсполнительныйЛистФиксСуммойДоПредела" Тогда 
				Возврат НСтр( "ru='Исполнительный лист фиксированной суммой до предела';uk='Виконавчий лист фіксованою сумою до межі';" ,КодЯзыка);		
			ИначеЕсли ИмяДляПеревода = "КомпенсацияНевыплаченнойЗарплаты" Тогда 
				Возврат НСтр( "ru='Компенсация невыплаченной зарплаты';uk='Компенсація заработку, що не виплачено';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "НулеваяСумма" Тогда 
				Возврат НСтр( "ru='Нулевая сумма';uk='Нульова сума';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ПоДневнойТарифнойСтавке" Тогда 
				Возврат НСтр( "ru='По дневной тарифной ставке';uk='За денною тарифною ставкою';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ПоМесячнойТарифнойСтавкеПоДням" Тогда 
				Возврат НСтр( "ru='По месячной тарифной ставке';uk='За місячною тарифною ставкою';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ПоМесячнойТарифнойСтавкеПоЧасам" Тогда 
				Возврат НСтр( "ru='По месячной тарифной ставке по часам';uk='За місячною тарифною ставкою по годинах';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ПоСреднемуЗаработку" Тогда 
				Возврат НСтр( "ru='По среднему заработку';uk='За середнім заробітком';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ПоСреднемуЗаработкуДляОтпуска" Тогда 
				Возврат НСтр( "ru='По среднему заработку для отпуска';uk='За середнім заробітком для відпустки';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ПоСреднемуЗаработкуФСС" Тогда 
				Возврат НСтр( "ru='По среднему заработку ФСС';uk='За середнім заробітком ФСС';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ПоЧасовойТарифнойСтавке" Тогда 
				Возврат НСтр( "ru='По часовой тарифной ставке';uk='За годинною тарифною ставкою';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ПоЧасовойТарифнойСтавкеУмножитьНаПроцент" Тогда 
				Возврат НСтр( "ru='По часовой тарифной ставке умножить на процент';uk='За годинною тарифною ставкою помножити на відсоток';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ПочтовыйСбор" Тогда 
				Возврат НСтр( "ru='Почтовый сбор';uk='Поштовий збір';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Процентом" Тогда 
				Возврат НСтр( "ru='Процентом';uk='Відсотком';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "СдельныйЗаработок" Тогда 
				Возврат НСтр( "ru='Сдельный заработок';uk='Відрядний заробіток';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ФиксированнойСуммой" Тогда 
				Возврат НСтр( "ru='Фиксированной суммой';uk='Фіксованою сумою';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ВыходноеПособие" Тогда 
				Возврат НСтр( "ru='Выходное пособие';uk='Вихідна допомога';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ПоСреднемуЗаработкуКомпенсацияОтпуска" Тогда 
				Возврат НСтр( "ru='По среднему заработку (компенсация отпуска)';uk='За середнім заробітком (компенсація відпустки)';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ПоСреднемуЗаработкуВозвратОтпуска" Тогда 
				Возврат НСтр( "ru='По среднему заработку (возврат отпуска)';uk='За середнім заробітком (поверненя відпустки)';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ПоДоговоруФиксированнойСуммой" Тогда 
				Возврат НСтр( "ru='По договору фиксированной суммой';uk='За договором фіксованою сумою';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ПроизвольнаяФормула" Тогда 
				Возврат НСтр( "ru='Произвольная формула';uk='Довільна формула';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ДоначислениеОтОбратного" Тогда 
				Возврат НСтр( "ru='Доначисление от обратного';uk='Донарахування від зворотнього';" ,КодЯзыка);
			КонецЕсли;			
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияРаботникаОрганизации" Тогда 
			Если ИмяДляПеревода = "Работает" Тогда 	
			    Возврат НСтр( "ru='Работает';uk='Працює';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "НеРаботает" Тогда 	
			    Возврат НСтр( "ru='Уволен';uk='Звільнений';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Заболевание" Тогда 	
			    Возврат НСтр( "ru='Болеет';uk='Хворіє';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Командировка" Тогда 	
			    Возврат НСтр( "ru='В командировке';uk='У відрядженні';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ОтпускЕжегодный" Тогда 	
			    Возврат НСтр( "ru='В ежегодном отпуске';uk='У щорічній відпустці';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ОтпускУчебный" Тогда 	
			    Возврат НСтр( "ru='Отпуск учебный';uk='Відпустка навчальна';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ОтпускБезСохраненияЗарплаты" Тогда 	
			    Возврат НСтр( "ru='Отпуск без сохранения зарплаты';uk='Відпустка без збереження зарплати';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ОтпускПоУходуЗаРебенком" Тогда 	
			    Возврат НСтр( "ru='Отпуск по уходу за ребенком';uk='Відпустка по догляду за дитиною';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ОтсутствуетПоНевыясненнойПричине" Тогда 	
			    Возврат НСтр( "ru='Отсутствует по невыясненной причине';uk='Відсутній через незясовані причини';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ОтпускУчебныйНеоплачиваемый" Тогда 	
			    Возврат НСтр( "ru='Отпуск учебный неоплачиваемый';uk='Відпустка навчальна без оплати';" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "ВынужденныйПрогул" Тогда 	
			    Возврат НСтр( "ru='Время вынужденного прогула';uk='час вимушеного прогулу';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ГосударственныеОбязанности" Тогда 	
			    Возврат НСтр( "ru='Время исполнения государственных или общественных обязанностей';uk='час виконання державних або суспільних обовязків';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Прогулы" Тогда 	
			    Возврат НСтр( "ru='Прогулы';uk='Прогули';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ДополнительныеВыходныеДниОплачиваемые" Тогда 	
			    Возврат НСтр( "ru='Дополнительные выходные дни (оплачиваемые)';uk='Додаткові вихідні дні (оплачуються)';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Простой" Тогда 	
			    Возврат НСтр( "ru='Простой';uk='Простій';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ОтпускПоБеременностиИРодам" Тогда 	
			    Возврат НСтр( "ru='Отпуск по беременности и родам';uk='Відпустка через вагітність та пологи';" ,КодЯзыка);	
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.СостоянияРаботника" Тогда 
			Если ИмяДляПеревода = "Работает" Тогда 	
			    Возврат НСтр( "ru='Работает';uk='Працює';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "НеРаботает" Тогда 	
			    Возврат НСтр( "ru='Уволен';uk='Звільнений';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Заболевание" Тогда 	
			    Возврат НСтр( "ru='Болеет';uk='Хворіє';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Командировка" Тогда 	
			    Возврат НСтр( "ru='В командировке';uk='У відрядженні';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ОтпускПрочий" Тогда 	
			    Возврат НСтр( "ru='Отпуск прочий';uk='Відпустка інша';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ОтпускУчебный" Тогда 	
			    Возврат НСтр( "ru='Отпуск учебный';uk='Відпустка навчальна';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ОтсутствуетПоНевыясненнойПричине" Тогда 	
			    Возврат НСтр( "ru='Отсутствует по невыясненной причине';uk='Відсутній через незясовані причини';" ,КодЯзыка);
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыЗанятостиВОрганизации" Тогда 
			Если ИмяДляПеревода = "ОсновноеМестоРаботы" Тогда 	
			    Возврат НСтр( "ru='Основное место работы';uk='Основне місце роботи';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Совместительство" Тогда 	
			    Возврат НСтр( "ru='Внешнее совместительство';uk='Зовнішнє сумісництво';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ВнутреннееСовместительство" Тогда 	
			    Возврат НСтр( "ru='Внутреннее совместительство';uk='Внутрішнє сумісництво';" ,КодЯзыка);
			КонецЕсли;	
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыТарифныхСтавок" Тогда 
			Если ИмяДляПеревода = "Месячная" Тогда 
				Возврат НСтр( "ru='Месячная';uk='Місячна';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Дневная" Тогда 
				Возврат НСтр( "ru='Дневная';uk='Денна';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Часовая" Тогда 
				Возврат НСтр( "ru='Часовая';uk='Годинна';" ,КодЯзыка);	
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ГруппыИнвалидности" Тогда 
			Если ИмяДляПеревода = "ПерваяГруппа" Тогда 
				Возврат НСтр( "ru='Первая (I)';uk='Перша (I)';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВтораяГруппа" Тогда 
				Возврат НСтр( "ru='Вторая (II)';uk='Друга (II)';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "ТретьяГруппа" Тогда 
				Возврат НСтр( "ru='Третья (III)';uk='Третя (III)';" ,КодЯзыка);	
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ИспытательныйСрок" Тогда 
			Если ИмяДляПеревода = "СИспытательнымСроком" Тогда 
				Возврат НСтр( "ru='С испытательным сроком (I)';uk='З випробувальним терміном';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "БезИспытательногоСрока" Тогда 
				Возврат НСтр( "ru='Без испытательного срока';uk='Без випробувального терміну';" ,КодЯзыка);
			КонецЕсли;			
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.РезультатыИспытательногоСрока" Тогда 
			Если ИмяДляПеревода = "Положительный" Тогда 
				Возврат НСтр( "ru='Положительный';uk='Позитивний';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Отрицательный" Тогда 
				Возврат НСтр( "ru='Отрицательный';uk='Негативний';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Продлен" Тогда 
				Возврат НСтр( "ru='Продлен';uk='Подовжено';" ,КодЯзыка);	
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ФормыОбучения" Тогда 
			Если ИмяДляПеревода = "Очная" Тогда 
				Возврат НСтр( "ru='Очная';uk='Очна';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "Заочная" Тогда 
				Возврат НСтр( "ru='Заочная';uk='Заочна';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Вечерняя" Тогда 
				Возврат НСтр( "ru='Вечерняя';uk='Вечірня';" ,КодЯзыка);	
			ИначеЕсли ИмяДляПеревода = "Экстернат" Тогда 
				Возврат НСтр( "ru='Экстернат';uk='Екстернат';" ,КодЯзыка);		
			ИначеЕсли ИмяДляПеревода = "Прочее" Тогда 
				Возврат НСтр( "ru='Прочее';uk='Інше';" ,КодЯзыка);			
			КонецЕсли;	
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийОтпускаОрганизаций" Тогда 
			Если ИмяДляПеревода = "Отпуск" Тогда 
				Возврат НСтр( "ru='Отпуск';uk='Відпустка';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "КомпенсацияОтпуска" Тогда 
				Возврат НСтр( "ru='Компенсация отпуска';uk='Компенсація відпустки';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "КорректировкаОтпуска" Тогда 
				Возврат НСтр( "ru='Корректировка отпуска';uk='Коригування відпустки';" ,КодЯзыка);	
			КонецЕсли;		
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПКО" Тогда 
			Если ИмяДляПеревода = "РасчетыПоКредитамИЗаймамСРаботниками" Тогда 
				Возврат НСтр( "ru='Расчеты по кредитам и займам с работниками';uk='Розрахунки за кредитами і позиками з працівниками';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВозвратДенежныхСредствРаботником" Тогда 
				Возврат НСтр( "ru='Возврат денежных средств работником';uk='Повернення грошових коштів працівником';" ,КодЯзыка);
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийПлатежныйОрдерСписание" Тогда 
			Если ИмяДляПеревода = "ПеречислениеНалога" Тогда 
				Возврат НСтр( "ru='Перечисление налога';uk='Перерахування податку';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеречислениеЗаработнойПлаты" Тогда 
				Возврат НСтр( "ru='Перечисление заработной платы';uk='Перерахування заробітної плати';" ,КодЯзыка);
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийППВходящее" Тогда 
			Если ИмяДляПеревода = "ПоступлениеСредствОтФСС" Тогда 
				Возврат НСтр( "ru='Поступление средств от ФСС';uk='Надходження коштів від ФСС';" ,КодЯзыка);			
			КонецЕсли;	
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийППИсходящее" Тогда 
			Если ИмяДляПеревода = "ПеречислениеНалога" Тогда 
				Возврат НСтр( "ru='Перечисление налога';uk='Перерахування податку';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ПеречислениеЗП" Тогда 
				Возврат НСтр( "ru='Перечисление заработной платы';uk='Перерахування заробітної плати';" ,КодЯзыка);
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ВидыОперацийРКО" Тогда 
			Если ИмяДляПеревода = "ВыплатаЗаработнойПлаты" Тогда 
				Возврат НСтр( "ru='Выплата заработной платы';uk='Виплата заробітної плати';" ,КодЯзыка);			
			ИначеЕсли ИмяДляПеревода = "ВыплатаЗаработнойПлатыРаботнику" Тогда 
				Возврат НСтр( "ru='Выплата заработной платы работнику';uk='Виплата заробітної плати працівнику';" ,КодЯзыка);
			КонецЕсли;	
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.Периодичность" Тогда 
			Если ИмяДляПеревода = "День" Тогда 	
			    Возврат НСтр( "ru='День';uk='День';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Неделя" Тогда 	
			    Возврат НСтр( "ru='Неделя';uk='Тиждень';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Месяц" Тогда 	
			    Возврат НСтр( "ru='Месяц';uk='Місяць';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Квартал" Тогда 	
			    Возврат НСтр( "ru='Квартал';uk='Квартал';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Год" Тогда 	
			    Возврат НСтр( "ru='Год';uk='Рік';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Декада" Тогда 	
			    Возврат НСтр( "ru='Декада';uk='Декада';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Полугодие" Тогда 	
			    Возврат НСтр( "ru='Полугодие';uk='Півріччя';" ,КодЯзыка);
			КонецЕсли;
			
		ИначеЕсли ПолноеИмяОбъектаМетаданных = "Перечисление.ПричиныИзмененияСостояния" Тогда 
			Если ИмяДляПеревода = "ПриемНаРаботу" Тогда 	
			    Возврат НСтр( "ru='Прием на работу';uk='Прийом на роботу';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Перемещение" Тогда 	
			    Возврат НСтр( "ru='Перемещение';uk='Переміщення';" ,КодЯзыка);
			ИначеЕсли ИмяДляПеревода = "Увольнение" Тогда 	
			    Возврат НСтр( "ru='Увольнение';uk='Звільнення';" ,КодЯзыка);
			КонецЕсли;
			
			
			
		КонецЕсли;	
		
		Если ПустаяСтрока(СинонимМетаданных) Тогда
			Возврат "";
		Иначе
			Возврат ЛокализацияПовтИсп.ПолучитьПереводТекста(СинонимМетаданных);
		КонецЕсли; 
		
КонецФункции // ОбработатьПереводы()


Процедура РазделитьСлово(СловоДляПеревода, Слово, Префикс, Суффикс, КодЯзыкаРезультат, КодЯзыкаИсточник)

	Префикс = "";
	Суффикс = "";
	
	// обработаем пробелы в конце
	Слово = СокрП(СловоДляПеревода);
	Если СтрДлина(Слово) <> СтрДлина(СловоДляПеревода) Тогда
		Суффикс = Сред(СловоДляПеревода, СтрДлина(Слово) + 1) + Суффикс;
	КонецЕсли;	
	
	// обработаем : в конце
	Если Прав(Слово, 1) = ":" Тогда
		Суффикс = ":" + Суффикс;
		Слово = Лев(Слово, СтрДлина(Слово) - 1);
	КонецЕсли; 
	
	СтрокаКатегории = НСтр("ru=' (категории)';uk=' (категорії)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаКатегории)) = СтрокаКатегории Тогда
		Суффикс = НСтр("ru=' (категории)';uk=' (категорії)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаКатегории));
	КонецЕсли; 
	
	СтрокаКатегория = НСтр("ru='(категория ';uk='(категорія '", КодЯзыкаИсточник);
	ПозКатегория = Найти(Слово, СтрокаКатегория);
	Если ПозКатегория <> 0 Тогда
		Префикс = Лев(Слово, ПозКатегория - 1);
		Префикс = Префикс + НСтр("ru='(категория ';uk='(категорія '", КодЯзыкаРезультат);
		Слово   = Сред(Слово, ПозКатегория + СтрДлина(СтрокаКатегория));
		Слово   = Сред(Слово, 1, СтрДлина(Слово) - 1);
		Суффикс = ")" + Суффикс;
	КонецЕсли; 
	
	СтрокаСвойство = НСтр("ru='(св-во ';uk='(вл-ть '", КодЯзыкаИсточник);
	ПозСвойство = Найти(Слово, СтрокаСвойство);
	Если ПозСвойство <> 0 Тогда
		Префикс = Лев(Слово, ПозСвойство - 1);
		Префикс = Префикс + НСтр("ru='(св-во ';uk='(вл-ть '", КодЯзыкаРезультат);
		Слово   = Сред(Слово, ПозСвойство + СтрДлина(СтрокаСвойство));
		Слово   = Сред(Слово, 1, СтрДлина(Слово) - 1);
		Суффикс = ")" + Суффикс;
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (нач. ост.)';uk=' (поч. зал.)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (нач. ост.)';uk=' (поч. зал.)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (приход)';uk=' (надходження)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (приход)';uk=' (надходження)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (расход)';uk=' (видаток)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (расход)';uk=' (видаток)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (кон. ост.)';uk=' (кін. зал.)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (кон. ост.)';uk=' (кін. зал.)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (оборот)';uk=' (оборот)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (оборот)';uk=' (оборот)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = " (" + глЗначениеПеременной("ВалютаУправленческогоУчета") + ")";
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = " (" + глЗначениеПеременной("ВалютаУправленческогоУчета") + ")" + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = " (" + глЗначениеПеременной("ВалютаРегламентированногоУчета") + ")";
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = " (" + глЗначениеПеременной("ВалютаРегламентированногоУчета") + ")" + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = " (" + глЗначениеПеременной("ВалютаМеждународногоУчета") + ")";
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = " (" + глЗначениеПеременной("ВалютаМеждународногоУчета") + ")" + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (в ед. хранения)';uk=' (у од. зберігання)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (в ед. хранения)';uk=' (у од. зберігання)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (в базовых ед.)';uk=' (у базових од.)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (в базовых ед.)';uk=' (у базових од.)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (в ед. отчетов)';uk=' (у од. звітів)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (в ед. отчетов)';uk=' (у од. звітів)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (в ед. заказа)';uk=' (у од. замовлення)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (в ед. заказа)';uk=' (у од. замовлення)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (в валюте упр. учета)';uk=' (у валюті упр. обліку)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (в валюте упр. учета)';uk=' (у валюті упр. обліку)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (в валюте регл. учета)';uk=' (у валюті регл. обліку)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (в валюте регл. учета)';uk=' (у валюті регл. обліку)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (в валюте взаиморасчетов)';uk=' (у валюті взаєморозрахунків)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (в валюте взаиморасчетов)';uk=' (у валюті взаєморозрахунків)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (управленческий учет)';uk=' (управлінський облік)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (управленческий учет)';uk=' (управлінський облік)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (бухгалтерский учет)';uk=' (бухгалтерський облік)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (бухгалтерский учет)';uk=' (бухгалтерський облік)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (налоговый учет)';uk=' (податковий облік)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (налоговый учет)';uk=' (податковий облік)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	СтрокаПроверки = НСтр("ru=' (международный учет)';uk=' (міжнародний облік)'", КодЯзыкаИсточник);
	Если Прав(Слово, СтрДлина(СтрокаПроверки)) = СтрокаПроверки Тогда
		Суффикс = НСтр("ru=' (международный учет)';uk=' (міжнародний облік)'", КодЯзыкаРезультат) + Суффикс;
		Слово   = Лев(Слово, СтрДлина(Слово) - СтрДлина(СтрокаПроверки));
	КонецЕсли; 
	
	
	СловоБезПробелов = СокрП(Слово);
	Если СтрДлина(Слово) <> СтрДлина(СловоБезПробелов) Тогда
		Суффикс = Сред(Слово, СтрДлина(СловоБезПробелов) + 1) + Суффикс;
		Слово   = СловоБезПробелов;
	КонецЕсли;	
	
КонецПроцедуры // РазделитьСлово()

Функция ПолучитьПереводСлова(СловоДляПеревода, КодЯзыкаРезультат = Неопределено, КодЯзыкаИсточник = "ru") Экспорт
	
	Если КодЯзыкаРезультат = Неопределено Тогда
		КодЯзыкаРезультат = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	КонецЕсли; 
	
	Если КодЯзыкаРезультат = КодЯзыкаИсточник Тогда	
		// переводить не требуется
		Возврат СловоДляПеревода;
	КонецЕсли; 
	
	Слово   = СловоДляПеревода;
	Префикс = "";
	Суффикс = "";
	
	РазделитьСлово(СловоДляПеревода, Слово, Префикс, Суффикс, КодЯзыкаРезультат, КодЯзыкаИсточник);
	
	ХешИсточник = ЛокализацияПовтИсп.ПолучитьХешСтроки(Слово);
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	| 	Переводы.ТекстRU КАК Текст,
	|   Переводы.ТекстUK КАК Перевод
	|ИЗ 
	|	РегистрСведений.ПереводыТекстов КАК Переводы
	|ГДЕ
	|	Переводы.ХешRU = &Хеш 
	|";
	
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "RU", ВРЕГ(КодЯзыкаИсточник));
	Запрос.Текст = СтрЗаменить(Запрос.Текст, "UK", ВРЕГ(КодЯзыкаРезультат));
	
	Запрос.УстановитьПараметр("Хеш", ХешИсточник);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Количество = Выборка.Количество();
	
	Результат = "";
	НеобходимоДобавить = Истина;
	
	Если Количество = 0 Тогда
		НеобходимоДобавить = Истина;
	ИначеЕсли Количество = 1 Тогда
		Выборка.Следующий();
		Если Выборка.Текст = Слово Тогда
			Результат = Выборка.Перевод;
			НеобходимоДобавить = Ложь;
		КонецЕсли;	
	Иначе
		Пока Выборка.Следующий() Цикл 
			Если Выборка.Текст = Слово Тогда
				Результат = Выборка.Перевод;
				НеобходимоДобавить = Ложь;
				Прервать;
			КонецЕсли; 	
		КонецЦикла;	
	КонецЕсли; 
	
	Если НеобходимоДобавить Тогда
		
		Запись = РегистрыСведений.ПереводыТекстов.СоздатьМенеджерЗаписи();
		
		ИмяПоляТекстИсточник  = "Текст" + ВРЕГ(КодЯзыкаИсточник);
		ИмяПоляТекстРезультат = "Текст" + ВРЕГ(КодЯзыкаРезультат);
		
		Запись[ИмяПоляТекстИсточник]  = Слово;
		Запись[ИмяПоляТекстРезультат] = "";
		
		Запись.Записать();
		Если ТестовыйРежим() Тогда
			Сообщить("ПолучитьПереводСлова - добавлена запись в РегистрыСведений.Переводы для " + Слово + ", необходимо добавить перевод на " + ВРЕГ(КодЯзыкаРезультат));
		КонецЕсли; 
		
		Результат = Слово;
		
	ИначеЕсли ПустаяСтрока(Результат) Тогда
		
		Если ТестовыйРежим() Тогда
			Сообщить("ПолучитьПереводСлова - не найден перевод для " + Слово + " на " + ВРЕГ(КодЯзыкаРезультат));
		КонецЕсли; 
		
		Результат = Слово;
		
	КонецЕсли; 
	
	Возврат Префикс + Результат + Суффикс;

КонецФункции // ПолучитьПереводСлова()


Функция ПолучитьМассивНаименованийСубконто() Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст = "
	|ВЫБРАТЬ
	|	ВидыСубконтоХозрасчетные.Наименование КАК Наименование
	|ИЗ
	|	ПланВидовХарактеристик.ВидыСубконтоХозрасчетные КАК ВидыСубконтоХозрасчетные
	|";	
	
	Результат = Запрос.Выполнить().Выгрузить().ВыгрузитьКолонку("Наименование");
	
	Возврат Результат;

КонецФункции // ПолучитьМассивНаименованийСубконто()
 

Функция ПолучитьПереводТекста(Текст, КодЯзыкаРезультат = Неопределено, КодЯзыкаИсточник = "ru", ПереводитьСубконто = Истина) Экспорт
	
	Если КодЯзыкаРезультат = Неопределено Тогда
		КодЯзыкаРезультат = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	КонецЕсли; 
	
	Если КодЯзыкаРезультат = КодЯзыкаИсточник Тогда	
		// переводить не требуется
		Возврат Текст;
	КонецЕсли; 
	
	Если ПустаяСтрока(Текст) Тогда
		Возврат Текст;
	КонецЕсли; 
	
	Если Не ПереводитьСубконто Тогда
		МассивНепереводимыхСлов = ЛокализацияПовтИсп.ПолучитьМассивНаименованийСубконто();
	Иначе
		МассивНепереводимыхСлов = Неопределено;
	КонецЕсли; 
	
	МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Текст, ".", Ложь);
	КоличествоСтрок = МассивСтрок.Количество();
	
	ПереводитьКакПодстроки = Ложь;
	
	Если КоличествоСтрок > 1 Тогда
		ПереводитьКакПодстроки = Истина;
		
		Для Индекс = 1 По КоличествоСтрок - 1 Цикл
			ТекСтрока  = МассивСтрок[Индекс];
			ПредСтрока = МассивСтрок[Индекс - 1];
			ПервыйСимволПредыдущей = Лев(ПредСтрока, 1);
			Если НЕ (ЛокализацияПовтИсп.СимволБуква(ПервыйСимволПредыдущей) ИЛИ ЛокализацияПовтИсп.СимволЦифра(ПервыйСимволПредыдущей)) Тогда
				ПереводитьКакПодстроки = Ложь;
				Прервать;
			КонецЕсли; 
			ПервыйСимволТекущей = Лев(ТекСтрока, 1);
			Если НЕ (ЛокализацияПовтИсп.СимволБуква(ПервыйСимволТекущей) И ВРЕГ(ПервыйСимволТекущей) = ПервыйСимволТекущей) Тогда
				ПереводитьКакПодстроки = Ложь;
				Прервать;
			КонецЕсли; 
		КонецЦикла; 
	КонецЕсли;	
	
	Если ПереводитьКакПодстроки Тогда
		Результат = "";
		Для Индекс = 0 По КоличествоСтрок - 1 Цикл
			Если МассивНепереводимыхСлов <> Неопределено И МассивНепереводимыхСлов.Найти(МассивСтрок[Индекс]) <> Неопределено Тогда
				ПереводСлова = МассивСтрок[Индекс];
			Иначе
				ПереводСлова = ЛокализацияПовтИсп.ПолучитьПереводСлова(МассивСтрок[Индекс], КодЯзыкаРезультат, КодЯзыкаИсточник);
			КонецЕсли;
				
			Результат = Результат 
						+ ?(ПустаяСтрока(Результат), "", ".") 
						+ ПереводСлова;
						
		КонецЦикла; 
		Возврат Результат;
	Иначе
		МассивСтрок = СтроковыеФункцииКлиентСервер.РазложитьСтрокуВМассивПодстрок(Текст, Символы.ПС, Ложь);
		КоличествоСтрок = МассивСтрок.Количество();
		Если КоличествоСтрок = 1 Тогда
			Если МассивНепереводимыхСлов <> Неопределено И МассивНепереводимыхСлов.Найти(Текст) <> Неопределено Тогда
				Возврат Текст;
			Иначе
				Возврат ЛокализацияПовтИсп.ПолучитьПереводСлова(Текст, КодЯзыкаРезультат, КодЯзыкаИсточник);
			КонецЕсли;	
		Иначе	
			Результат = "";
			Для Индекс = 0 По КоличествоСтрок - 1 Цикл
				
				Если МассивНепереводимыхСлов <> Неопределено И МассивНепереводимыхСлов.Найти(МассивСтрок[Индекс]) <> Неопределено Тогда
					ПереводСлова = МассивСтрок[Индекс];
				Иначе
					ПереводСлова = ЛокализацияПовтИсп.ПолучитьПереводСлова(МассивСтрок[Индекс], КодЯзыкаРезультат, КодЯзыкаИсточник);
				КонецЕсли;
				
				Результат = Результат 
							+ ?(ПустаяСтрока(Результат), "", Символы.ПС) 
							+ ПереводСлова;
				
				
			КонецЦикла; 
			Возврат Результат;
		КонецЕсли; 
	КонецЕсли;

КонецФункции // ПолучитьПереводТекста()

Функция ОбработатьИсключенияЗначенийПолейСКД(ЗначениеПоля, КодЯзыка) Экспорт
	
	НовоеЗначениеПоля = Неопределено; 
	
	Если Лев(ЗначениеПоля, 7) = "Период:" Тогда
		
		НовоеЗначениеПоля = НСтр("ru='Период:';uk='Період:'", КодЯзыка) + 
							Сред(ЗначениеПоля, 8);
							
							
	ИначеЕсли Лев(ЗначениеПоля, 27) = "Период формирования отчета:" Тогда
		
		НовоеЗначениеПоля = НСтр("ru='Период формирования отчета:';uk='Період формування звіту:'", КодЯзыка) + 
							Сред(ЗначениеПоля, 28);
							
	ИначеЕсли Лев(ЗначениеПоля, 5) = "Дата:" Тогда
		
		НовоеЗначениеПоля = НСтр("ru='Дата:';uk='Дата:'", КодЯзыка) + 
							Сред(ЗначениеПоля, 6);
							
	ИначеЕсли ЗначениеПоля = НСтр("ru='Итого';uk='Разом'", КодЯзыка) Тогда
		// не переводим, СКД "сама перевела"
		НовоеЗначениеПоля = ЗначениеПоля;
	КонецЕсли; 
	
	Возврат НовоеЗначениеПоля;

КонецФункции // ОбработатьИсключенияЗначенийПолейСКД()

Функция ПолучитьХешСтроки(Строка) Экспорт
	
	
	МаксХеш = 4294967295; // Pow(2, 32) - 1
	Простое = 33; 

	Результат = 0;
	
	Длина = СтрДлина(Строка);
	
	Если Длина = 0 Тогда
		Возврат 0;
	КонецЕсли; 
	
	Для Поз = 1 По Длина Цикл
		Результат = Результат * Простое + КодСимвола(Строка, Поз);
		Если Результат > МаксХеш Тогда
			Результат = Результат % МаксХеш;
		КонецЕсли; 
	КонецЦикла; 
	
	Возврат Результат;
	
КонецФункции // ПолучитьХешСтроки()

Функция ПолучитьПереводДляОтчетовНаСКД(Строка, КодЯзыка = Неопределено, ПереводитьСубконто = Истина) Экспорт	
	Возврат ЛокализацияПовтИсп.ПолучитьПереводТекста(Строка, КодЯзыка,,ПереводитьСубконто);
КонецФункции // ПолучитьПереводДляОтчетовНаСКД()

Функция ПолучитьФорматЯзыкаДляПредставленияВСхемахСКД() Экспорт
	
	КодЯзыка  = ЛокализацияПовтИсп.ПолучитьЯзыкФормированияПечатныхФормОтчетов();
	Результат = ";Л=" + ?(КодЯзыка = "uk","uk_UA","ru_RU");
	
	Возврат Результат;

КонецФункции // ПолучитьФорматЯзыкаДляПредставленияВСхемахСКД()


// Проверяет, является ли символ цифрой.
//
// Параметры:
//  СимволПроверки - символ для проверки.
//
// Возвращаемое значение:
//  Истина       - символ является цифрой;
//  Ложь         - символ не является цифрой;
//
Функция СимволЦифра(Знач СимволПроверки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СимволПроверки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КодСимвола = КодСимвола(СимволПроверки);
	Если НЕ (КодСимвола >= 48 И КодСимвола <= 57) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // СимволЦифра()

// Проверяет, является ли символ символом кириллического алфавита.
//
// Параметры: 
//    СимволПроверки - символ проверки
//
// Возвращаемое значение:
//  Истина       - символ является символом кириллического алфавита;
//  Ложь         - символ не является символом кириллического алфавита или пустой;
//
Функция СимволКириллица(Знач СимволПроверки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СимволПроверки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КодыДопустимыхСимволов = Новый Массив;
	КодыДопустимыхСимволов.Добавить(1105); // "ё"
	КодыДопустимыхСимволов.Добавить(1025); // "Ё"
	КодыДопустимыхСимволов.Добавить(1110); // "і"
	КодыДопустимыхСимволов.Добавить(1030); // "І"
	КодыДопустимыхСимволов.Добавить(1111); // "ї"
	КодыДопустимыхСимволов.Добавить(1031); // "Ї"
	КодыДопустимыхСимволов.Добавить(1108); // "є"
	КодыДопустимыхСимволов.Добавить(1028); // "Є"
	
	КодСимвола = КодСимвола(СимволПроверки);
	Если ((КодСимвола < 1040) Или (КодСимвола > 1103)) 
		И (КодыДопустимыхСимволов.Найти(КодСимвола) = Неопределено) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // СимволКириллица

// Проверяет, является ли символ символом латинского или кириллического алфавита.
//
// Параметры: 
//    СимволПроверки - символ проверки
//
// Возвращаемое значение:
//  Истина       - символ является символом латинского алфавита;
//  Ложь         - символ не является символом латинского алфавита или пустой;
//
Функция СимволЛатиница(Знач СимволПроверки) Экспорт
	
	Если НЕ ЗначениеЗаполнено(СимволПроверки) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	КодСимвола = КодСимвола(СимволПроверки);
	Если ((КодСимвола < 65) Или (КодСимвола > 90 И КодСимвола < 97) Или (КодСимвола > 122)) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции // СимволЛатиница

// Проверяет, является ли символ символом символом латинского или кириллического алфавита.
//
// Параметры: 
//    СимволПроверки - символ проверки
//
// Возвращаемое значение:
//  Истина       - символ является символом латинского или кириллического алфавита;
//  Ложь         - символ не является символом латинского или кириллического алфавита или пустой;
//
Функция СимволБуква(Знач СимволПроверки) Экспорт
	
	Возврат ЛокализацияПовтИсп.СимволКириллица(СимволПроверки) ИЛИ ЛокализацияПовтИсп.СимволЛатиница(СимволПроверки);
	
КонецФункции // СимволБуква

Функция ТестовыйРежим() Экспорт
	Возврат Ложь; 
КонецФункции // ТестовыйРежим()


