
&НаКлиенте
Процедура НестандартПриИзменении(Элемент)
	 УстановитьТипДанныхНестандарт();
	 УстановитьНаименование();
КонецПроцедуры


&НаКлиенте
Процедура НестандартАркаПриИзменении(Элемент)
	 УстановитьТипДанныхНестандарт();
	 УстановитьНаименование();
КонецПроцедуры

&НаСервере
Процедура УстановитьТипыДанных()
	//Элементы.СправочникОбъектШирина.ВыбиратьТип 	 = Ложь;
	//Элементы.СправочникОбъектВысота.ВыбиратьТип 	 = Ложь;
	//Элементы.СправочникОбъектТолщина.ВыбиратьТип 	 = Ложь;
	
	Если СправочникОбъект.Нестандарт Тогда
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("Число"));

		 Элементы.СправочникОбъектШирина.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Элементы.СправочникОбъектВысота.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Элементы.СправочникОбъектТолщина.ОграничениеТипа = Новый ОписаниеТипов(Массив);
	Иначе
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеШирины"));
		 Элементы.СправочникОбъектШирина.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеВысоты"));
		 Элементы.СправочникОбъектВысота.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеТолщины"));
		 Элементы.СправочникОбъектТолщина.ОграничениеТипа = Новый ОписаниеТипов(Массив);
	 КонецЕсли;	
	 
 КонецПроцедуры	

 &НаСервере
Процедура УстановитьТипыДанныхКапитель()
	//Элементы.СправочникОбъектШирина.ВыбиратьТип 	 = Ложь;
	//Элементы.СправочникОбъектВысота.ВыбиратьТип 	 = Ложь;
	//Элементы.СправочникОбъектТолщина.ВыбиратьТип 	 = Ложь;
	
	Если СправочникОбъект.Нестандарт Тогда
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("Число"));

		 Элементы.ШиринаКапитель.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Элементы.ВысотаКапитель.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
	Иначе
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеШирины"));
		 Элементы.ШиринаКапитель.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеВысоты"));
		 Элементы.ВысотаКапитель.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
	КонецЕсли;	
	 
 КонецПроцедуры	

&НаСервере
Процедура УстановитьТипыДанныхКоробка()
	
	Если СправочникОбъект.Нестандарт Тогда
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("Число"));

		 Элементы.ШиринаКоробка.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Элементы.ВысотаКоробка.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Элементы.ТолщинаКоробка.ОграничениеТипа = Новый ОписаниеТипов(Массив);
		 Элементы.Поперечка.ОграничениеТипа = Новый ОписаниеТипов(Массив);
		 Элементы.УголЗарезки.ОграничениеТипа = Новый ОписаниеТипов(Массив);
	 Иначе
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеШирины"));
		 Элементы.ШиринаКоробка.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеВысоты"));
		 Элементы.ВысотаКоробка.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеТолщины"));
		 Элементы.ТолщинаКоробка.ОграничениеТипа = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеПоперечки"));
		 Элементы.Поперечка.ОграничениеТипа = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеУглыЗарезки"));
		 Элементы.УголЗарезки.ОграничениеТипа = Новый ОписаниеТипов(Массив);
	 КонецЕсли;	
	 
 КонецПроцедуры	
 
&НаСервере
Процедура УстановитьТипыДанныхНаличник()
	
	Если СправочникОбъект.Нестандарт Тогда
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("Число"));

		 Элементы.ШиринаНаличиник.ОграничениеТипа  		= Новый ОписаниеТипов(Массив);
		 Элементы.ВысотаНаличник.ОграничениеТипа  		= Новый ОписаниеТипов(Массив);
		 Элементы.ТолщинаНаличник.ОграничениеТипа 		= Новый ОписаниеТипов(Массив);
		 Элементы.ПоперечкаНаличник.ОграничениеТипа 	= Новый ОписаниеТипов(Массив);
		 Элементы.УголЗарезкиНаличник.ОграничениеТипа 	= Новый ОписаниеТипов(Массив);
		 Элементы.ДлинаНожки.ОграничениеТипа 			= Новый ОписаниеТипов(Массив);
	 Иначе
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеШирины"));
		 Элементы.ШиринаНаличиник.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеВысоты"));
		 Элементы.ВысотаНаличник.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеТолщины"));
		 Элементы.ТолщинаНаличник.ОграничениеТипа = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеПоперечки"));
		 Элементы.ПоперечкаНаличник.ОграничениеТипа = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеУглыЗарезки"));
		 Элементы.УголЗарезкиНаличник.ОграничениеТипа = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеДлины"));
		 Элементы.ДлинаНожки.ОграничениеТипа = Новый ОписаниеТипов(Массив);
	КонецЕсли;	
	 
 КонецПроцедуры	
 
 
&НаСервере
Процедура УстановитьТипыДанныхАрка()
	//Элементы.СправочникОбъектШирина.ВыбиратьТип 	 = Ложь;
	//Элементы.СправочникОбъектВысота.ВыбиратьТип 	 = Ложь;
	//Элементы.СправочникОбъектТолщина.ВыбиратьТип 	 = Ложь;
	
	Если СправочникОбъект.Нестандарт Тогда
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("Число"));

		 Элементы.Ширина.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Элементы.Высота.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Элементы.Толщина.ОграничениеТипа = Новый ОписаниеТипов(Массив);
	Иначе
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеШирины"));
		 Элементы.Ширина.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеВысоты"));
		 Элементы.Высота.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеТолщины"));
		 Элементы.Толщина.ОграничениеТипа = Новый ОписаниеТипов(Массив);
	 КонецЕсли;	
	 
 КонецПроцедуры	
 
&НаСервере
Процедура УстановитьТипыДанныхПланкаДробная()
	
	Если СправочникОбъект.Нестандарт Тогда
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("Число"));

		 Элементы.ШиринаПланкаДробная.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Элементы.ВысотаПланкаДробная.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Элементы.ТолщинаПланкаДробная.ОграничениеТипа = Новый ОписаниеТипов(Массив);
	Иначе
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеШирины"));
		 Элементы.ШиринаПланкаДробная.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеВысоты"));
		 Элементы.ВысотаПланкаДробная.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеТолщины"));
		 Элементы.ТолщинаПланкаДробная.ОграничениеТипа = Новый ОписаниеТипов(Массив);
	 КонецЕсли;	
	 
 КонецПроцедуры	
 
 &НаСервере
 Процедура УстановитьТипыДанныхПлинтус()
	
	Если СправочникОбъект.Нестандарт Тогда
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("Число"));
		 Элементы.Длина.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
	Иначе
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеДлины"));
		 Элементы.Длина.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
	 КонецЕсли;	
	 
 КонецПроцедуры	

 &НаСервере
 Процедура УстановитьТипыДанныхПланкаПритворная()
	
	Если СправочникОбъект.Нестандарт Тогда
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("Число"));

		 Элементы.ШиринаПланкаПритворная.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Элементы.ВысотаПланкаПритворная.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Элементы.ТолщинаПланкаПритворная.ОграничениеТипа = Новый ОписаниеТипов(Массив);
		 Элементы.ТолщинаДвериПланкаПритворная.ОграничениеТипа = Новый ОписаниеТипов(Массив);
	Иначе
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеШирины"));
		 Элементы.ШиринаПланкаПритворная.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеВысоты"));
		 Элементы.ВысотаПланкаПритворная.ОграничениеТипа  = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеТолщины"));
		 Элементы.ТолщинаПланкаПритворная.ОграничениеТипа = Новый ОписаниеТипов(Массив);
		 Массив = Новый Массив;
		 Массив.Добавить(Тип("СправочникСсылка.СтандартныеТолщины"));
		 Элементы.ТолщинаДвериПланкаПритворная.ОграничениеТипа = Новый ОписаниеТипов(Массив);
	 КонецЕсли;	
	 
 КонецПроцедуры	
 
 
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	 ОтобразитьСтраницуПоВидуИзделия();
	 УстановитьТипыДанных();
	 УстановитьНаименование();
 КонецПроцедуры

&НаСервере
 Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	 //Объект = Параметры.Справочник;
 КонецПроцедуры

&НаКлиенте
Процедура УстановитьНаименование()
	Если ЭтоДверноеПолотно() Тогда
		Наименование = УстановитьНаименованиеДверногоПолотна();
	ИначеЕсли ЭтоАрка() Тогда
		Наименование = УстановитьНаименованиеАрки();
	ИначеЕсли ЭтоКапитель() Тогда
		Наименование = УстановитьНаименованиеКапитель();
	ИначеЕсли ЭтоКоробка() Тогда
		Наименование = УстановитьНаименованиеКоробки();
	ИначеЕсли ЭтоНаличники() Тогда
		Наименование = УстановитьНаименованиеНаличника();
	ИначеЕсли ЭтоПланкаДробная() Тогда
		Наименование = УстановитьНаименованиеПланкаДробная();
	ИначеЕсли ЭтоПланкаПритворная() Тогда
		Наименование = УстановитьНаименованиеПланкаПритворная();
	ИначеЕсли ЭтоПлинтус() Тогда
		Наименование = УстановитьНаименованиеПлинтус();
	КонецЕсли;	
КонецПроцедуры	
 
&НаКлиенте
Процедура СправочникОбъектВидИзделияПриИзменении(Элемент)
	 ОтобразитьСтраницуПоВидуИзделия();
	 УстановитьТипДанныхНестандарт();
	 УстановитьНаименование();
 КонецПроцедуры
 
 &НаСервере
Функция ЭтоДверноеПолотно()
	 Возврат СправочникОбъект.ВидИзделия = Справочники.ВидИзделия.ДверноеПолотно;
КонецФункции
 
 &НаСервере
Функция ЭтоАрка()
	 Возврат СправочникОбъект.ВидИзделия = Справочники.ВидИзделия.Арка;
КонецФункции

 &НаСервере
Функция ЭтоКапитель()
	 Возврат СправочникОбъект.ВидИзделия = Справочники.ВидИзделия.Капитель;
КонецФункции

 &НаСервере
Функция ЭтоКоробка()
	 Возврат СправочникОбъект.ВидИзделия = Справочники.ВидИзделия.Коробка;
КонецФункции

 &НаСервере
Функция ЭтоНаличники()
	 Возврат СправочникОбъект.ВидИзделия = Справочники.ВидИзделия.Наличник;
КонецФункции

&НаСервере
Функция ЭтоПланкаДробная()
	 Возврат СправочникОбъект.ВидИзделия = Справочники.ВидИзделия.ПланкаДоборная;
КонецФункции	

&НаСервере
Функция ЭтоПланкаПритворная()
	 Возврат СправочникОбъект.ВидИзделия = Справочники.ВидИзделия.ПланкаПритворная;
КонецФункции	

&НаСервере
Функция ЭтоПлинтус()
	 Возврат СправочникОбъект.ВидИзделия = Справочники.ВидИзделия.Плинтус;
КонецФункции	


&НаСервере
Функция УстановитьНаименованиеДверногоПолотна()
	 СтрокаНаименование = СправочникОбъект.ВидИзделия.Наименование + " " + СправочникОбъект.Модель.Наименование + " " + 
		 				  СправочникОбъект.Направление.Наименование + " " + Формат(СправочникОбъект.Ширина,"ЧГ=0") + "х" + Формат(СправочникОбъект.Высота,"ЧГ=0") + "х" + Формат(СправочникОбъект.Толщина,"ЧГ=0") + " " +
		 				  СправочникОбъект.ВидПокрытия.Наименование + " " + СправочникОбъект.Декор.Наименование + " " + СправочникОбъект.Стекло.Наименование + " " + СправочникОбъект.Фурнитура + " " + СправочникОбъект.Герметизация + " " + СправочникОбъект.Кромка;
	 СтрокаНаименование = СокрЛП(СтрокаНаименование);
	 СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "х ", " ");
	 СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "  ", " ");
	 Возврат СтрокаНаименование;
КонецФункции	

&НаСервере
Функция УстановитьНаименованиеАрки()
	 СтрокаНаименование = СправочникОбъект.ВидИзделия.Наименование + " " + СправочникОбъект.Модель.Наименование + " " + 
		 				  Формат(СправочникОбъект.Ширина,"ЧГ=0") + "х" + Формат(СправочникОбъект.Толщина,"ЧГ=0") + "х" + Формат(СправочникОбъект.Высота,"ЧГ=0") + " " +
		 				  СправочникОбъект.ВидПокрытия.Наименование + " " + СправочникОбъект.Декор.Наименование;
	 СтрокаНаименование = СокрЛП(СтрокаНаименование);
	 СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "х ", " ");
	 СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "  ", " ");
	 Возврат СтрокаНаименование;
КонецФункции	

&НаСервере
Функция УстановитьНаименованиеКапитель()
	 СтрокаНаименование = СправочникОбъект.ВидИзделия.Наименование + " " +
		 				  Формат(СправочникОбъект.Высота,"ЧГ=0") + "х" + Формат(СправочникОбъект.Ширина,"ЧГ=0")+ " " +
		 				  СправочникОбъект.ВидПокрытия.Наименование + " " + СправочникОбъект.Декор.Наименование;
	 СтрокаНаименование = СокрЛП(СтрокаНаименование);
	 СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "х ", " ");
	 СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "  ", " ");
	 Возврат СтрокаНаименование;
КонецФункции	

&НаСервере
Функция УстановитьНаименованиеКоробки()
	 СтрокаНаименование = СправочникОбъект.ВидИзделия.Наименование + " " + СправочникОбъект.Видматериала.Наименование + " " + 
		 				  СправочникОбъект.ТипКоробки.Наименование + " " + Формат(СправочникОбъект.Ширина,"ЧГ=0") + "х" + Формат(СправочникОбъект.Толщина,"ЧГ=0") + "х" + Формат(СправочникОбъект.Высота,"ЧГ=0") + "х" + Формат(СправочникОбъект.Поперечка,"ЧГ=0") + "х" + Формат(СправочникОбъект.УголЗарезки,"ЧГ=0") + " " +
		 				  СправочникОбъект.ВидПокрытия.Наименование + " " + СправочникОбъект.Декор.Наименование + " " + СправочникОбъект.Комплектация.Наименование + " " + СправочникОбъект.Уплотнитель + " " + Формат(СправочникОбъект.ТолщинаДвери,"ЧГ=0") + " " + ?(СправочникОбъект.Фрезеровка,"F","") + " " + СправочникОбъект.Направление + " " + СправочникОбъект.Герметизация + " " + СправочникОбъект.ВидУпаковки;
	 СтрокаНаименование = СокрЛП(СтрокаНаименование);
	 СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "х ", " ");
	 СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "  ", " ");
	 Возврат СтрокаНаименование;
КонецФункции	

&НаСервере
Функция УстановитьНаименованиеНаличника()
	 СтрокаНаименование = СправочникОбъект.ВидИзделия.Наименование + " " + СправочникОбъект.Видматериала.Наименование + " " + 
		 				  Формат(СправочникОбъект.Ширина,"ЧГ=0") + "х" + Формат(СправочникОбъект.Толщина,"ЧГ=0") + "х" + Формат(СправочникОбъект.Высота,"ЧГ=0") + "х" + Формат(СправочникОбъект.Длина,"ЧГ=0") + "х" + Формат(СправочникОбъект.Поперечка,"ЧГ=0") + "х" + Формат(СправочникОбъект.УголЗарезки,"ЧГ=0") + " " +
		 				  СправочникОбъект.ВидПокрытия.Наименование + " " + СправочникОбъект.Декор.Наименование + " " + СправочникОбъект.Комплектация.Наименование + " " + СправочникОбъект.Герметизация + " " +  СправочникОбъект.ВидУпаковки;
	 СтрокаНаименование = СокрЛП(СтрокаНаименование);
	 СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "х ", " ");
	 СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "  ", " ");
	 Возврат СтрокаНаименование;
КонецФункции	

&НаСервере
Функция УстановитьНаименованиеПланкаДробная()
	 СтрокаНаименование = СправочникОбъект.ВидИзделия.Наименование + " " + СправочникОбъект.Видматериала.Наименование + " " + 
		 				  Формат(СправочникОбъект.Ширина,"ЧГ=0") + "х" + Формат(СправочникОбъект.Толщина,"ЧГ=0") + "х" + Формат(СправочникОбъект.Высота,"ЧГ=0") + " " +
		 				  СправочникОбъект.ВидПокрытия.Наименование + " " + СправочникОбъект.Декор.Наименование + " " + СправочникОбъект.ВидУпаковки.Наименование;
	 СтрокаНаименование = СокрЛП(СтрокаНаименование);
	 СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "х ", " ");
	 СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "  ", " ");
	 Возврат СтрокаНаименование;
КонецФункции	

&НаСервере
Функция УстановитьНаименованиеПланкаПритворная()
	 СтрокаНаименование = СправочникОбъект.ВидИзделия.Наименование + " " + СправочникОбъект.Видматериала.Наименование + " " + 
		 				  Формат(СправочникОбъект.Ширина,"ЧГ=0") + "х" + Формат(СправочникОбъект.Толщина,"ЧГ=0") + "х" + Формат(СправочникОбъект.Высота,"ЧГ=0") + " " +
		 				  СправочникОбъект.ВидПокрытия.Наименование + " " + СправочникОбъект.Декор.Наименование + " " + СправочникОбъект.Комплектация.Наименование + " " + СправочникОбъект.Уплотнитель.Наименование + " " + Формат(СправочникОбъект.ТолщинаДвери, "ЧГ=0");
	 СтрокаНаименование = СокрЛП(СтрокаНаименование);
	 СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "х ", " ");
	 СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "  ", " ");
	 Возврат СтрокаНаименование;
КонецФункции	

&НаСервере
Функция УстановитьНаименованиеПлинтус()
	 СтрокаНаименование = СправочникОбъект.ВидИзделия.Наименование + " " + Формат(СправочникОбъект.Длина,"ЧГ=0") + " " +
	 	 				  СправочникОбъект.ВидПокрытия.Наименование + " " + СправочникОбъект.Декор.Наименование;
	 СтрокаНаименование = СокрЛП(СтрокаНаименование);
	 СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "х ", " ");
	 СтрокаНаименование = СтрЗаменить(СтрокаНаименование, "  ", " ");
	 Возврат СтрокаНаименование;
КонецФункции	

&НаКлиенте
Процедура СправочникОбъектМодельПриИзменении(Элемент)
	 УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура СправочникОбъектНаправлениеПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура СправочникОбъектШиринаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура СправочникОбъектВысотаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура СправочникОбъектТолщинаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры
 
 
&НаКлиенте
Процедура ОтобразитьСтраницуПоВидуИзделия()
	Если ЭтоДверноеПолотно() Тогда
		Элементы.СтраницаДверноеПолотно.Видимость = Истина;
		Элементы.СтраницаАрка.Видимость			  = Ложь;
		Элементы.СтраницаКапитель.Видимость		  = Ложь;
		Элементы.СтраницаКоробка.Видимость		  = Ложь;
		Элементы.СтраницаНаличники.Видимость	  = Ложь;		
		Элементы.СтраницаПланкаДробная.Видимость  = Ложь;				
		Элементы.СтраницаПланкаПритворная.Видимость  = Ложь;	
		Элементы.СтраницаПлинтус.Видимость  	  = Ложь;	
	ИначеЕсли ЭтоАрка() Тогда
		Элементы.СтраницаДверноеПолотно.Видимость = Ложь;
		Элементы.СтраницаАрка.Видимость			  = Истина;
		Элементы.СтраницаКапитель.Видимость		  = Ложь;
		Элементы.СтраницаКоробка.Видимость		  = Ложь;
		Элементы.СтраницаНаличники.Видимость	  = Ложь;		
		Элементы.СтраницаПланкаДробная.Видимость  = Ложь;				
		Элементы.СтраницаПланкаПритворная.Видимость  = Ложь;	
		Элементы.СтраницаПлинтус.Видимость  	  = Ложь;	
    ИначеЕсли ЭтоКапитель() Тогда
		Элементы.СтраницаДверноеПолотно.Видимость = Ложь;
		Элементы.СтраницаАрка.Видимость			  = Ложь;
		Элементы.СтраницаКапитель.Видимость		  = Истина;
		Элементы.СтраницаКоробка.Видимость		  = Ложь;
		Элементы.СтраницаНаличники.Видимость	  = Ложь;		
		Элементы.СтраницаПланкаДробная.Видимость  = Ложь;				
		Элементы.СтраницаПланкаПритворная.Видимость  = Ложь;	
		Элементы.СтраницаПлинтус.Видимость  	  = Ложь;	
	ИначеЕсли ЭтоКоробка() Тогда
		Элементы.СтраницаДверноеПолотно.Видимость = Ложь;
		Элементы.СтраницаАрка.Видимость			  = Ложь;
		Элементы.СтраницаКапитель.Видимость		  = Ложь;
		Элементы.СтраницаКоробка.Видимость		  = Истина;
		Элементы.СтраницаНаличники.Видимость	  = Ложь;		
		Элементы.СтраницаПланкаДробная.Видимость  = Ложь;				
		Элементы.СтраницаПланкаПритворная.Видимость  = Ложь;	
		Элементы.СтраницаПлинтус.Видимость  	  = Ложь;	
	ИначеЕсли ЭтоНаличники() Тогда
		Элементы.СтраницаДверноеПолотно.Видимость = Ложь;
		Элементы.СтраницаАрка.Видимость			  = Ложь;
		Элементы.СтраницаКапитель.Видимость		  = Ложь;
		Элементы.СтраницаКоробка.Видимость		  = Ложь;
		Элементы.СтраницаНаличники.Видимость	  = Истина;
		Элементы.СтраницаПланкаДробная.Видимость  = Ложь;				
		Элементы.СтраницаПланкаПритворная.Видимость  = Ложь;	
		Элементы.СтраницаПлинтус.Видимость  	  = Ложь;	
	ИначеЕсли ЭтоПланкаДробная() Тогда
		Элементы.СтраницаДверноеПолотно.Видимость = Ложь;
		Элементы.СтраницаАрка.Видимость			  = Ложь;
		Элементы.СтраницаКапитель.Видимость		  = Ложь;
		Элементы.СтраницаКоробка.Видимость		  = Ложь;
		Элементы.СтраницаНаличники.Видимость	  = Ложь;
		Элементы.СтраницаПланкаДробная.Видимость  = Истина;
		Элементы.СтраницаПланкаПритворная.Видимость  = Ложь;	
		Элементы.СтраницаПлинтус.Видимость  	  = Ложь;	
	ИначеЕсли ЭтоПланкаПритворная() Тогда
		Элементы.СтраницаДверноеПолотно.Видимость = Ложь;
		Элементы.СтраницаАрка.Видимость			  = Ложь;
		Элементы.СтраницаКапитель.Видимость		  = Ложь;
		Элементы.СтраницаКоробка.Видимость		  = Ложь;
		Элементы.СтраницаНаличники.Видимость	  = Ложь;
		Элементы.СтраницаПланкаДробная.Видимость  = Ложь;
		Элементы.СтраницаПланкаПритворная.Видимость  = Истина;	
		Элементы.СтраницаПлинтус.Видимость  	  = Ложь;	
	ИначеЕсли ЭтоПлинтус() Тогда
		Элементы.СтраницаДверноеПолотно.Видимость = Ложь;
		Элементы.СтраницаАрка.Видимость			  = Ложь;
		Элементы.СтраницаКапитель.Видимость		  = Ложь;
		Элементы.СтраницаКоробка.Видимость		  = Ложь;
		Элементы.СтраницаНаличники.Видимость	  = Ложь;
		Элементы.СтраницаПланкаДробная.Видимость  = Ложь;
		Элементы.СтраницаПланкаПритворная.Видимость  = Ложь;	
		Элементы.СтраницаПлинтус.Видимость  	  = Истина;	
	Иначе 
		Элементы.СтраницаДверноеПолотно.Видимость = Ложь;
		Элементы.СтраницаАрка.Видимость			  = Ложь;
		Элементы.СтраницаКапитель.Видимость		  = Ложь;
		Элементы.СтраницаКоробка.Видимость		  = Ложь;
		Элементы.СтраницаНаличники.Видимость	  = Ложь;
		Элементы.СтраницаПланкаДробная.Видимость  = Ложь;	
		Элементы.СтраницаПланкаПритворная.Видимость  = Ложь;	
		Элементы.СтраницаПлинтус.Видимость  	  = Ложь;	
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура МодельПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ШиринаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТолщинаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВысотаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВидПокрытияАркаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура Декор1ПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НестандартКапительПриИзменении(Элемент)
	УстановитьТипДанныхНестандарт();
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВысотаКапительПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ШиринаКапительПриИзменении(Элемент)
	Установитьнаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВидПокрытияКапительПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДекорКапительПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НестандартКоробкаПриИзменении(Элемент)
	УстановитьТипДанныхНестандарт();
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВидматериалаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТипКоробкиПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ШиринаКоробкаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТолщинаКоробкаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВысотаКоробкаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПоперечкаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура УголЗарезкиПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВидПокрытияКоробкаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДекорКоробкаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура КомплектацияПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура УплотнительПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТолщинаДвериПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ФрезеровкаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НаправлениеПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура Герметизация1ПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВидУпаковкиПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НестандартНаличникПриИзменении(Элемент)
	УстановитьТипДанныхНестандарт();
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВидМатериалаНаличникиПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ШиринаНаличиникПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТолщинаНаличникПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВысотаНаличникПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДлинаНожкиПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ПоперечкаНаличникПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура УголЗарезкиНаличникПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВидПокрытияНаличникиПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДекорНаличникикПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура КомплектацияНаличникикПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ГерметизацияНаличникикПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВидУпаковкиНаличникикПриИзменении(Элемент)
		УстановитьНаименование();
КонецПроцедуры

&НаСервере
Процедура УстановитьТипДанныхНестандарт()
	Если ЭтоДверноеПолотно() Тогда
		УстановитьТипыДанных();
	ИначеЕсли ЭтоАрка() Тогда
		УстановитьТипыДанныхАрка();
	иначеЕсли ЭтоНаличники() Тогда
		УстановитьТипыДанныхНаличник();
	иначеЕсли ЭтоКоробка() тогда
		УстановитьТипыДанныхКоробка();
	ИначеЕсли ЭтоКапитель() Тогда
		УстановитьТипыДанныхКапитель();
	ИначеЕсли ЭтоПланкаДробная() Тогда
		УстановитьТипыДанныхПланкаДробная();
	ИначеЕсли ЭтоПланкаПритворная() Тогда
		УстановитьТипыДанныхПланкаПритворная();
	ИначеЕсли ЭтоПлинтус() Тогда
		УстановитьТипыДанныхПлинтус();
	КонецЕсли;	
КонецПроцедуры	

&НаКлиенте
Процедура НестандартПланкаДробнаяПриИзменении(Элемент)
	УстановитьТипДанныхНестандарт();
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВидматериалаПланкаДробнаяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ШиринаПланкаДробнаяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТолщинаПланкаДробнаяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВысотаПланкаДробнаяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВидПокрытияПланкадробнаяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДекорПланкаДробнаяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВидУпаковкиПлакнаДробнаяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НестандартПланкаПритворнаяПриИзменении(Элемент)
	УстановитьТипДанныхНестандарт();
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВидМатериалаПланкаПритворнаяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ШиринаПланкаПритворнаяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТолщинаПланкаПритворнаяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВысотаПланкаПритворнаяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВидПокрытияПланкаПритворнаяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДекорПланкаПритворнаяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура КомплектацияПланкаПритворнаяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура УплотнительПланкаПритворнаяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ТолщинаДвериПланкаПритворнаяПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура НестандартПлинтусПриИзменении(Элемент)
	УстановитьТипДанныхНестандарт();
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДлинаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ВидПокрытияПлинтусПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

&НаКлиенте
Процедура ДекорПлинтусПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры


&НаКлиенте
Процедура ЗаписатьДанные(Команда)
	СтруктураРеквизитов = ПолучитьСтруктуруРеквизитов();
	ЭтаФорма.Закрыть(СтруктураРеквизитов);
КонецПроцедуры

&НаСервере
Функция ПолучитьСтруктуруРеквизитов()
	СтруктураРеквизитов = Новый Структура(); 
	СтруктураРеквизитов.Вставить("ВидИзделия", СправочникОбъект.ВидИзделия);
	СтруктураРеквизитов.Вставить("Модель", СправочникОбъект.Модель);
	СтруктураРеквизитов.Вставить("Стекло", СправочникОбъект.Стекло);
	СтруктураРеквизитов.Вставить("Направление", СправочникОбъект.Направление);
	СтруктураРеквизитов.Вставить("Ширина", СправочникОбъект.Ширина);
	СтруктураРеквизитов.Вставить("Высота", СправочникОбъект.Высота);
	СтруктураРеквизитов.Вставить("Толщина", СправочникОбъект.Толщина);
	СтруктураРеквизитов.Вставить("ВидПокрытия", СправочникОбъект.ВидПокрытия);
	СтруктураРеквизитов.Вставить("Декор", СправочникОбъект.Декор);
	СтруктураРеквизитов.Вставить("Фурнитура", СправочникОбъект.Фурнитура);
	СтруктураРеквизитов.Вставить("Герметизация", СправочникОбъект.Герметизация);
	СтруктураРеквизитов.Вставить("Кромка", СправочникОбъект.Кромка);
	СтруктураРеквизитов.Вставить("Нестандарт", СправочникОбъект.Нестандарт);
	СтруктураРеквизитов.Вставить("Видматериала", СправочникОбъект.Видматериала);
	СтруктураРеквизитов.Вставить("ТипКоробки", СправочникОбъект.ТипКоробки);
	СтруктураРеквизитов.Вставить("Поперечка", СправочникОбъект.Поперечка);
	СтруктураРеквизитов.Вставить("УголЗарезки", СправочникОбъект.УголЗарезки);
	СтруктураРеквизитов.Вставить("Комплектация", СправочникОбъект.Комплектация);
	СтруктураРеквизитов.Вставить("Уплотнитель", СправочникОбъект.Уплотнитель);
	СтруктураРеквизитов.Вставить("ТолщинаДвери", СправочникОбъект.ТолщинаДвери);
	СтруктураРеквизитов.Вставить("Фрезеровка", СправочникОбъект.Фрезеровка);
	СтруктураРеквизитов.Вставить("ВидУпаковки", СправочникОбъект.ВидУпаковки);
	СтруктураРеквизитов.Вставить("Длина", СправочникОбъект.Длина);
	СтруктураРеквизитов.Вставить("Наименование", Наименование);
	Возврат СтруктураРеквизитов;
КонецФункции	


&НаКлиенте
Процедура ДекорАркаПриИзменении(Элемент)
	УстановитьНаименование();
КонецПроцедуры

