////////////////////////////////////////////////////////////////////////////////
// Подсистема "Обмен данными"
// 
////////////////////////////////////////////////////////////////////////////////

////////////////////////////////////////////////////////////////////////////////
// Обработчики событий изменения данных

////////////////////////////////////////////////////////////////////////////////
// Обмен УПП - Документооборот

// Процедура-обработчик события "ПередЗаписью" ссылочных типов данных (кроме документов) для механизма регистрации объектов на узлах
//
// Параметры:
//  ИмяПланаОбмена – Строка – имя плана обмена, для которого выполняется механизм регистрации
//  Источник       - источник события, кроме типа ДокументОбъект
//  Отказ          - Булево - флаг отказа от выполнения обработчика
//
Процедура ОбменДОУПППередЗаписью(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписью("ОбменУправлениеПроизводственнымПредприятиемДокументооборот", Источник, Отказ);
	
КонецПроцедуры

// Процедура-обработчик события "ПередЗаписью" регистров для механизма регистрации объектов на узлах
//
// Параметры:
//  ИмяПланаОбмена – Строка – имя плана обмена, для которого выполняется механизм регистрации
//  Источник       - НаборЗаписейРегистра - источник события
//  Отказ          - Булево - флаг отказа от выполнения обработчика
//  Замещение      - Булево - признак замещения существующего набора записей
//
Процедура ОбменДОУПППередУдалением(Источник, Отказ) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередУдалением("ОбменУправлениеПроизводственнымПредприятиемДокументооборот", Источник, Отказ);
	
КонецПроцедуры

// Процедура-обработчик события "ПередУдалением" ссылочных типов данных для механизма регистрации объектов на узлах
//
// Параметры:
//  ИмяПланаОбмена – Строка – имя плана обмена, для которого выполняется механизм регистрации
//  Источник       - источник события
//  Отказ          - Булево - флаг отказа от выполнения обработчика
//
Процедура ОбменДОУПППередЗаписьюРегистра(Источник, Отказ, Замещение) Экспорт
	
	ОбменДаннымиСобытия.МеханизмРегистрацииОбъектовПередЗаписьюРегистра("ОбменУправлениеПроизводственнымПредприятиемДокументооборот", Источник, Отказ, Замещение);
	
	// зарегистрируем владельца КИ, если это необходимо
	Если ТипЗнч(Источник) = Тип("РегистрСведенийНаборЗаписей.КонтактнаяИнформация") Тогда
		Объект = Источник.Отбор.Объект.Значение;
		ТипОбъекта = ТипЗнч(Объект);
		Если ТипОбъекта = Тип("СправочникСсылка.Организации")
			или ТипОбъекта = Тип("СправочникСсылка.Контрагенты")
			или ТипОбъекта = Тип("СправочникСсылка.КонтактныеЛицаКонтрагентов")
			или ТипОбъекта = Тип("СправочникСсылка.Пользователи")
			или ТипОбъекта = Тип("СправочникСсылка.ФизическиеЛица") Тогда
			Узлы = ОбменДаннымиПовтИсп.ПолучитьМассивУзловПланаОбмена("ОбменУправлениеПроизводственнымПредприятиемДокументооборот");
			ПланыОбмена.ЗарегистрироватьИзменения(Узлы, Объект);
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры