
&НаКлиенте
Процедура ПутьКФайлуЛогаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
			// Вставить содержимое обработчика.
	СтандартнаяОбработка=ложь;
	Диалог = Новый ДиалогВыбораФайла(РежимДиалогаВыбораФайла.Открытие);
	Диалог.Заголовок = "Выберите файл";
	Диалог.ПолноеИмяФайла = ""; 
	Фильтр = "TXT (*.txt)|*.txt"; 
	Диалог.Фильтр = Фильтр; 
    Диалог.МножественныйВыбор = Ложь;
	Диалог.Каталог = "C:\";
	Если Диалог.Выбрать() Тогда
		НаборКонстант.ПутьКФайлуЛогаСинхронизации = Диалог.ПолноеИмяФайла;
	КонецЕсли;

КонецПроцедуры
