// Обработчик события ПриИзменении элемента формы Наименование.
&НаКлиенте
Процедура НаименованиеПриИзменении(Элемент)
	
	Если ПустаяСтрока(Объект.НаименованиеПолное) Тогда
		Объект.НаименованиеПолное = Объект.Наименование;
	КонецЕсли;
	Если ПустаяСтрока(Объект.НаименованиеДляНалоговыхДокументов) Тогда
		Объект.НаименованиеДляНалоговыхДокументов = Объект.Наименование;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	// проверям, чтобы префикс был числовым. На формат не влияем
	Попытка
		
		ПрефиксЧисловой = Число(ТекущийОбъект.Префикс);
		Если ПрефиксЧисловой < 0  Тогда
			ПрефиксЧисловой = - ПрефиксЧисловой;
		КонецЕсли;
		
		// ТекущийОбъект.Префикс = Формат(ПрефиксЧисловой,"ЧЦ=4; ЧВН=; ЧГ=" );
		
	Исключение
		
		ТекущийОбъект.Префикс = "";
		
	КонецПопытки;
	
КонецПроцедуры
