////////////////////////////////////////////////////////////////////////////////
// Вспомогательные процедуры, функции

Процедура ДополнитьСоответствиеРолей(СоответствиеРолей) Экспорт
	
	МассивРолейИсполнителей = Новый Массив;
	МассивРолейИсполнителей.Добавить(Справочники.РолиИсполнителей.Расчетчик);
	СоответствиеРолей.Вставить(Метаданные.Роли.РасчетчикРегламентированнойЗарплаты, МассивРолейИсполнителей);
	
	МассивРолейИсполнителей = Новый Массив;
	МассивРолейИсполнителей.Добавить(Справочники.РолиИсполнителей.Кадровик);
	СоответствиеРолей.Вставить(Метаданные.Роли.КадровикРегламентированныхДанных, МассивРолейИсполнителей);

КонецПроцедуры

////////////////////////////////////////////////////////////////////////////////
// Дополнительные команды в форме списка

#Если ТолстыйКлиентОбычноеПриложение Тогда

Процедура ПередОткрытиемФормыСпискаДополнительно(Форма, СтруктураДляДополнительныхДействий, ДополнительныеДействия = Неопределено) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ПриЗакрытииФормыСпискаДополнительно(Форма, СтруктураДляДополнительныхДействий) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры

Процедура ВыполнитьДополнительныеДействия(Форма, СтруктураДляДополнительныхДействий, ИмяДействия) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры // ВыполнитьДополнительныеДействия

Процедура ОбработкаОжиданияДополнительногоДействия1(Форма, СтруктураДляДополнительныхДействий) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры // ВыполнитьДополнительныеДействия

Процедура ОбработкаОжиданияДополнительногоДействия2(Форма, СтруктураДляДополнительныхДействий) Экспорт
	
	// В этой конфигурации дополнительных действий не предусмотрено
	
КонецПроцедуры // ВыполнитьДополнительныеДействия

#КонецЕсли
