
///////////////////////////////////////////////////////////////////////////////
// ИНФОРМАЦИОННЫЕ БАЗЫ ДЛЯ ОБМЕНА
//////////////////////////////////////////////////////////////////////////////

Функция ПолучитьТаблицуВозможныхОбменов() Экспорт
	
	Таблица = Новый ТаблицаЗначений;
	Таблица.Колонки.Добавить("ИмяКонфигурации");
	Таблица.Колонки.Добавить("ИмяПланаОбмена");
	Таблица.Колонки.Добавить("НаименованиеКонфигурации");
	Таблица.Колонки.Добавить("ПредставлениеКонфигурации");
	Таблица.Колонки.Добавить("ПрефиксПоУмолчанию");
	
	СтрокаТаблицы = Таблица.Добавить();
	СтрокаТаблицы.ИмяКонфигурации = "УПП"; // определяет макет с правилами обмена
	СтрокаТаблицы.ИмяПланаОбмена = "ОбменУППУПП"; // определяет имя плана обмена откуда брать данные
	СтрокаТаблицы.НаименованиеКонфигурации = Метаданные.Синоним; // Наименование конфигурации
	СтрокаТаблицы.ПредставлениеКонфигурации = СтрЗаменить(Метаданные.Синоним, ", редакция", ""); // Представление конфигурации
	СтрокаТаблицы.ПрефиксПоУмолчанию = "УПП"; // Префикс по умолчанию
	
	Возврат Таблица;
	
КонецФункции

Функция ПолучитьИнформациюОТекущейИнформационнойБазе() Экспорт
	
	СтруктураДанных = Новый Структура;
	СтруктураДанных.Вставить("ИмяКонфигурации", "УПП");
	СтруктураДанных.Вставить("ИмяПланаОбмена", "ОбменУППУПП");
	СтруктураДанных.Вставить("НаименованиеКонфигурации", Метаданные.Синоним);
	СтруктураДанных.Вставить("ПредставлениеКонфигурации", СтрЗаменить(Метаданные.Синоним, ", редакция", ""));
	СтруктураДанных.Вставить("ПрефиксПоУмолчанию", "УПП");
	
	Возврат СтруктураДанных;
	
КонецФункции


Процедура ОткрытьФормуВыполненияОбменаСБухгалтерией() Экспорт
			
	ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
	ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.ОбменУППУПП.ПустаяСсылка();
		
	ФормаВыполненияОбмена.Открыть();
	
КонецПроцедуры


Процедура ОткрытьФормуВыполненияОбменаРИБ() Экспорт
	
	ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
	ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.Полный.ПустаяСсылка();
		
	ФормаВыполненияОбмена.Открыть();
	
КонецПроцедуры

Процедура ОткрытьФормуВыполненияОбменаССайтом() Экспорт
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Недостаточно прав для выполнения обмена данными с сайтом.");
		Возврат;
	КонецЕсли;
	
	ФормаВыполненияОбмена = ПолучитьОбщуюФорму("ФормаВыполненияОбменаДанными");
	ФормаВыполненияОбмена.ОтборПоТипуПланаОбмена = ПланыОбмена.ОбменССайтомТоварами.ПустаяСсылка();
		
	ФормаВыполненияОбмена.Открыть();
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаУПП() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.ТипДанныхДляПоказа = ПланыОбмена.ОбменУППУПП.ПустаяСсылка();
	ФормаМонитора.Открыть();	
	
КонецПроцедуры


Процедура ОткрытьМониторОбменовДляОбменаССайтом() Экспорт
	
	Если НЕ РольДоступна("ПолныеПрава") Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Недостаточно прав для открытия ""Монитора настроек обмена данными"".");
		Возврат;
	КонецЕсли;
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.ТипДанныхДляПоказа = Справочники.НастройкиОбменаССайтом.ПустаяСсылка();
	ФормаМонитора.Открыть();	
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаРИБ() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.ТипДанныхДляПоказа = ПланыОбмена.Полный.ПустаяСсылка();
	ФормаМонитора.Открыть();	
	
КонецПроцедуры

Процедура ОткрытьМониторОбменовДляОбменаВсе() Экспорт
	
	ФормаМонитора = ПолучитьОбщуюФорму("МониторНастроекОбменаДанными");
	ФормаМонитора.Открыть();	
	
КонецПроцедуры

// Процедура открывает настройки обмена с ВЕБ-сайтом
//
Процедура НастроитьОбменДаннымиСВебСайтом() Экспорт

	Если НЕ РольДоступна("ПолныеПрава") Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Недостаточно прав для настройки обмена данными с WEB-сайтом.");
		Возврат;
	КонецЕсли;
	
	ОбработкаПомощника = Обработки.ПомощникНастройкиОбменаДаннымиССайтом.Создать();
	ФормаНастройки = ОбработкаПомощника.ПолучитьФорму("Форма");
	ФормаНастройки.Открыть();	

КонецПроцедуры

Процедура ОткрытьФормуНастроекОбменаРИБ() Экспорт
	
	ФормаCписка = ПолучитьОбщуюФорму("ФормаСпискаНастроекОбмена",, "НастройкиОбменаРИБ");
	ФормаCписка.ТипОбменаПоУмолчанию = ПланыОбмена.Полный.ПустаяСсылка();
	ФормаCписка.Открыть();
	
КонецПроцедуры

// {ОбменДаннымиБСП

/////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПОДДЕРЖКИ ОБМЕНА БСП

Процедура ОткрытьФормуУправленияОбменамиДанных() Экспорт
	
	#Если Клиент Тогда
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных") <> Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупрежденияИспользованияОбменаДанными82());
		Возврат;
	КонецЕсли;
	
	ОткрытьФорму("ОбщаяФорма.ОбменыДанными");
	#КонецЕсли
	
КонецПроцедуры

Процедура ОткрытьФормуСценариевОбменовДанными() Экспорт
	
	#Если Клиент Тогда
	Если ПолучитьФункциональнуюОпцию("ИспользоватьСинхронизациюДанных") <> Истина Тогда
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстПредупрежденияИспользованияОбменаДанными82());
		Возврат;
	КонецЕсли;
	
	СписокПлановОбмена = ОбменДаннымиПовтИсп.СписокПлановОбменаБСП();
	Если СписокПлановОбмена.Количество() = 0 Тогда
		ТекстСообщения = НСтр("ru = 'Возможность настройки синхронизации данных не предусмотрена.'");
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю(ТекстСообщения);
		Возврат;
	КонецЕсли;

	ОткрытьФорму("Справочник.СценарииОбменовДанными.Форма.НастройкаРасписанияОбменовДанными");
	#КонецЕсли
	
КонецПроцедуры

Функция ТекстПредупрежденияИспользованияОбменаДанными82()
	
	Возврат НСтр("ru = 'Данная возможность недоступна. Обратитесь к системному администратору.'");
	
КонецФункции

// }ОбменДаннымиБСП
