#Если Клиент Тогда

////////////////////////////////////////////////////////////////////////////////
// ПЕРЕМЕННЫЕ МОДУЛЯ

// Хранит таблицу значений - состав показателей отчета
Перем мТаблицаСоставПоказателей Экспорт;

// Хранит структуру - состав показателей отчета,
// значение которых автоматически заполняется по учетным данным.
Перем мСтруктураВариантыЗаполнения Экспорт;

// Хранит структуру многостраничных разделов
Перем мСтруктураМногостраничныхРазделов Экспорт;

// Хранит дерево значений - структуру листов отчета.
Перем мДеревоСтраницОтчета Экспорт;

// Хранит признак выбора печатных листов
Перем мЕстьВыбранные Экспорт;

// Хранит имя выбранной формы отчета
Перем мВыбраннаяФорма Экспорт;

// Хранит признак скопированной формы.
Перем мСкопированаФорма Экспорт;

// Хранит ссылку на документ РегламентированныйОтчет,
// хранящий данные отчета
Перем мСохраненныйДок Экспорт;

// Следующие переменные хранят границы
// периода построения отчета
Перем мДатаНачалаПериодаОтчета Экспорт;
Перем мДатаКонцаПериодаОтчета  Экспорт;

Перем мТаблицаФормОтчета Экспорт;

Перем мПолноеИмяФайлаВнешнейОбработки Экспорт;
Перем мЗаписьЗапрещена                Экспорт;

////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ И ФУНКЦИИ ОБЩЕГО НАЗНАЧЕНИЯ

// Формирует дерево значений - структуру страниц отчета,
// содержащей настройки показа страниц, вывода на печать и выгрузки в ИМНС.
//  требуется редакция по наименованиям ПолейТабличныхДокументов
////////////////////////////////////////////////////////////////////////////////
// ОПЕРАТОРЫ ОСНОВНОЙ ПРОГРАММЫ 

МассивТипов = Новый Массив; 
МассивТипов.Добавить(Тип("Строка"));
ОписаниеТиповСтрока15  = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(15, ДопустимаяДлина.Переменная));

МассивТипов = Новый Массив; 
МассивТипов.Добавить(Тип("Строка"));
ОписаниеТиповСтрока254 = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(254, ДопустимаяДлина.Переменная));

МассивБулево = Новый Массив;
МассивБулево.Добавить(Тип("Булево"));
ОписаниеТиповБулево    = Новый ОписаниеТипов(МассивБулево);

// Таблица значений хранит состав показателей отчета.
// В колонках таблицы хранятся следующие данные:
//    - имя поля табличного документа;
//    - код показатели по составу показателей;
//    - код показателя по форме (имя области табличного документа);
//    - признак многострочности;
//    - тип данных показателя.
//
мТаблицаСоставПоказателей         = Новый ТаблицаЗначений;
мТаблицаСоставПоказателей.Колонки.Добавить("ИмяПоляТаблДокумента",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоСоставу",  ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("КодПоказателяПоФорме",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ПризнМногострочности",    ОписаниеТиповСтрока15);
мТаблицаСоставПоказателей.Колонки.Добавить("ТипДанныхПоказателя",     ОписаниеТиповСтрока15);


мСтруктураВариантыЗаполнения      = Новый Структура;

МассивТипов = Новый Массив; 
МассивТипов.Добавить(Тип("Строка"));
ОписаниеТиповСтрока = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыСтроки(254, ДопустимаяДлина.Переменная));

МассивТипов = Новый Массив;
МассивТипов.Добавить(Тип("Дата"));
ОписаниеТиповДата = Новый ОписаниеТипов(МассивТипов, , Новый КвалификаторыДаты(ЧастиДаты.Дата));

мТаблицаФормОтчета = Новый ТаблицаЗначений;
мТаблицаФормОтчета.Колонки.Добавить("ФормаОтчета",        ОписаниеТиповСтрока);
мТаблицаФормОтчета.Колонки.Добавить("ОписаниеОтчета",     ОписаниеТиповСтрока, НСтр("ru='Утверждена';uk='Затверджена'"),  20);
мТаблицаФормОтчета.Колонки.Добавить("ДатаНачалоДействия", ОписаниеТиповДата,   НСтр("ru='Действует с';uk='Діє з'"), 5);
мТаблицаФормОтчета.Колонки.Добавить("ДатаКонецДействия",  ОписаниеТиповДата,   НСтр("ru='         по';uk='         по'"), 5);


Если РегламентированнаяОтчетность.ИДКонфигурации() = "УПП" Тогда
	НоваяФорма = мТаблицаФормОтчета.Добавить();
	НоваяФорма.ФормаОтчета        = "ФормаОтчета2003Кв1";
	НоваяФорма.ОписаниеОтчета     = НСтр("ru='Утверждена приказом Государственной налоговой администрации Украины  29.03.2003 №143';uk='Затверджена наказом Державної податкової адміністрації України  29.03.2003 №143'");
	НоваяФорма.ДатаНачалоДействия = '20020703';
	НоваяФорма.ДатаКонецДействия  = '20050930';
КонецЕсли;

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2005Кв4";
НоваяФорма.ОписаниеОтчета     = НСтр("ru='Утверждена приказом Государственной налоговой администрации Украины  12.10.2005 №448';uk='Затверджена наказом Державної податкової адміністрації України  12.10.2005 №448'");
НоваяФорма.ДатаНачалоДействия = '20051001';
НоваяФорма.ДатаКонецДействия  = '20110331';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2011Кв2";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Государственной налоговой администрации Украины  от 28.02.2011 №114'; uk = 'Затверджена наказом Державної податкової адміністрації України  від 28.02.2011 №114'");
НоваяФорма.ДатаНачалоДействия = '20110401';
НоваяФорма.ДатаКонецДействия  = '2011-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2014Кв1";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Миндоходов и сборов от 30.12.2013 № 872'; uk = 'Затверджена наказом Міндоходів та сборів від 30.12.2013 № 872'");
// за 4 кв 2013 г ДПС "рекомендует" сдавать отчет по форме, которая принята после отчетного периода....
НоваяФорма.ДатаНачалоДействия = '2013-10-01';
НоваяФорма.ДатаКонецДействия  = '2014-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2013Кв1";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 28.09.2011 №1213 с изменениями согласно приказу №1281 от 05.12.2012'; uk = 'Затверджена наказом Мінфіна від 28.09.2011 №1213 зі змінами згідно наказу №1281 від 05.12.2012'");
// за 4 кв 2012 г ДПС "рекомендует" сдавать отчет по форме, которая не вступила в действие
НоваяФорма.ДатаНачалоДействия = '2012-10-01';
НоваяФорма.ДатаКонецДействия  = '2013-12-31';

НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2012Кв1";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 28.09.2011 №1213'; uk = 'Затверджена наказом Мінфіна від 28.09.2011 №1213'");
НоваяФорма.ДатаНачалоДействия = '2012-01-01';
НоваяФорма.ДатаКонецДействия  = '2012-12-31';
	
НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2015Кв1";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 20.10.2015 №897'; uk = 'Затверджена наказом Мінфіна від 20.10.2015 №897'");
НоваяФорма.ДатаНачалоДействия = '2015-01-01';
НоваяФорма.ДатаКонецДействия  = '2016-06-30';
	
НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2016Кв3";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 08.07.2016 №585'; uk = 'Затверджена наказом Мінфіна від 08.07.2016 №585'");
НоваяФорма.ДатаНачалоДействия = '2016-07-01';
НоваяФорма.ДатаКонецДействия  = '2017-03-31';
	
НоваяФорма = мТаблицаФормОтчета.Добавить();
НоваяФорма.ФормаОтчета        = "ФормаОтчета2017Кв3";
НоваяФорма.ОписаниеОтчета     = НСтр("ru = 'Утверждена приказом Минфина от 08.07.2016 №585 (в редакции приказа Минфина от 28.04.2017 N 467)'; uk = 'Затверджена наказом Мінфіна від 08.07.2016 №585 (у редакції наказу Мінфіна від 28.04.2017 N 467)'");
НоваяФорма.ДатаНачалоДействия = '2017-04-01';
НоваяФорма.ДатаКонецДействия  = Неопределено;	
#КонецЕсли
