////////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ - ОБРАБОТЧИКИ СОБЫТИЙ ЭЛЕМЕНТОВ ФОРМЫ

&НаКлиенте
Процедура КнопкаОКВыполнить()
	
	Если Не ФорматMXL И Не ФорматXLS И Не ФорматHTML Тогда
		Предупреждение(НСтр("ru = 'Необходимо указать как минимум один из форматов: MXL, XLS или HTML!'"));
		Возврат;
	КонецЕсли;
	
	Результат = Новый Структура;
	Результат.Вставить("ЗапаковатьZIP", ЗапаковатьZIP);
	Результат.Вставить("ФорматMXL",     ФорматMXL);
	Результат.Вставить("ФорматXLS",     ФорматXLS);
	Результат.Вставить("ФорматHTML",    ФорматHTML);
	
	Закрыть(Результат);
	
КонецПроцедуры
