//РаботаСВнешнимОборудованием
Перем глПодключаемоеОборудование Экспорт; // для кэширования на клиенте
//Конец РаботаСВнешнимОборудованием

Перем глОбщиеЗначения Экспорт;

Перем глСерверТО Экспорт;
Перем АдресРесурсовОбозревателя Экспорт; // В переменной содержится значение 
                                         // адреса ресурса данной конфигурации

Перем мКлиентOnline;

Перем ПараметрыВнешнихРегламентированныхОтчетов Экспорт;

Перем ФормаОжиданияКурсов;

Перем глМенеджерЗвит1С Экспорт;

// СтандартныеПодсистемы

// БазоваяФункциональность

// СписокЗначений для накапливания пакета сообщений в журнал регистрации, 
// формируемых в клиентской бизнес-логике.
Перем СообщенияДляЖурналаРегистрации Экспорт; 

// Признак того, что в данном сеансе не нужно запрашивать стандартное подтверждение при выходе
Перем ПропуститьПредупреждениеПередЗавершениемРаботыСистемы Экспорт;

// Структура, содержащая в себе время начала и окончания обновления программы.
Перем ПараметрыРаботыКлиентаПриОбновлении Экспорт;

// Конец БазоваяФункциональность

// ОбновлениеКонфигурации
// Информация о доступном обновлении конфигурации, обнаруженном в Интернете
// при запуске программы.
Перем ДоступноеОбновлениеКонфигурации Экспорт;
// Структура с параметрами помощника обновления конфигурации.
Перем НастройкиОбновленияКонфигурации Экспорт; 

// Конец ОбновлениеКонфигурации

// ФайловыеФункции
Перем ПроверкаДоступаКРабочемуКаталогуВыполнена Экспорт; // Кэшируется, чтобы в данном сеансе повторно не делать проверку доступа к каталогу на диске
// Конец ФайловыеФункции

// Конец СтандартныеПодсистемы

////////////////////////////////////////////////////////////////////////////////
// ОБРАБОТЧИКИ СОБЫТИЙ

// Перед началом работы системы
//
Процедура ПередНачаломРаботыСистемы(Отказ)
	
	Если НЕ РольДоступна("Пользователь")
		И (НЕ РольДоступна("ПолныеПрава")) Тогда
		
		Предупреждение("Вам не назначена роль ""Пользователь"". Запуск конфигурации невозможен.");
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	Отказ = НЕ УправлениеПользователями.ПользовательОпределен();
	
	// ОбновлениеВерсииИБ
	Отказ = Отказ ИЛИ НЕ ОбновлениеИнформационнойБазыКлиент.ВозможноВыполнитьОбновлениеИнформационнойБазы();
	// Конец ОбновлениеВерсииИБ
	
	Если Не Отказ Тогда
		// СтандартныеПодсистемы
		СтандартныеПодсистемыКлиент.ДействияПередНачаломРаботыСистемы(Отказ);
		// Конец СтандартныеПодсистемы
	КонецЕсли;
	
КонецПроцедуры

// При начале работы системы
//
Процедура ПриНачалеРаботыСистемы()
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.ПроверитьВерсиюПлатформы("8.3.6.2299", "8.2.19.130");
	// Конец СтандартныеПодсистемы
	
	// СтандартныеПодсистемы
	СтандартныеПодсистемыКлиент.УстановитьПроизвольныйЗаголовокПриложения();
	// Конец СтандартныеПодсистемы
	
	АдресРесурсовОбозревателя = ОбновлениеКонфигурацииПереопределяемый.КороткоеИмяКонфигурации();
	
	// Установить начальное значение ТипДетализацииСтандартныхОтчетов
	Если УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ТипДетализацииСтандартныхОтчетов") = Перечисления.ТипДетализацииСтандартныхОтчетов.ПустаяСсылка() Тогда
		//УстановитьЗначениеПоУмолчанию(глТекущийПользователь, "ТипДетализацииСтандартныхОтчетов", Перечисления.ТипДетализацииСтандартныхОтчетов.Элементы);
		СсылкаНастройки = ПланыВидовХарактеристик.НастройкиПользователей["ТипДетализацииСтандартныхОтчетов"];
		МенеджерЗаписи = РегистрыСведений.НастройкиПользователей.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.Пользователь = глЗначениеПеременной("глТекущийПользователь");
		МенеджерЗаписи.Настройка = СсылкаНастройки;
		МенеджерЗаписи.Значение = Перечисления.ТипДетализацииСтандартныхОтчетов.Элементы;
		МенеджерЗаписи.Записать(Истина);
	КонецЕсли;
	    
	ЗапретитьОткрытиеНесколькихСеансов = УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ЗапретитьОткрытиеНесколькихСеансов");
	Если ЗапретитьОткрытиеНесколькихСеансов Тогда
		ТекущийНомерСоединения = НомерСоединенияИнформационнойБазы();
		УникальныйИдентификаторПользователя = ПользователиИнформационнойБазы.ТекущийПользователь().УникальныйИдентификатор;
		
		МассивСоединений = ПолучитьСоединенияИнформационнойБазы();
		Для Каждого ТекСоединение Из МассивСоединений Цикл
			Если (ТекСоединение.ИмяПриложения = "1CV8") 
			   И (НЕ ТекСоединение.НомерСоединения = ТекущийНомерСоединения)
			   И (НЕ ТекСоединение.Пользователь = неопределено)
			   И (ТекСоединение.Пользователь.УникальныйИдентификатор = УникальныйИдентификаторПользователя) Тогда
			  
				Предупреждение("Пользователем с таким именем уже выполнен вход в систему");
				ЗавершитьРаботуСистемы(Ложь);
				Возврат;
				
			КонецЕсли;
		КонецЦикла;	
	КонецЕсли;
	
	ОбновлениеИнформационнойБазыКлиент.ВыполнитьОбновлениеИнформационнойБазы();
	
	// Выполнить проверку разницы времени с сервером приложения
	Если НЕ ПроверкаРазницыВремениКлиент.ВыполнитьПроверку() Тогда
		Возврат;	
	КонецЕсли;
	
	// отработка параметров запуска системы
	Если ОбработатьПараметрыЗапуска(ПараметрЗапуска) Тогда
		Возврат;
	КонецЕсли;
	
	// ЗавершениеРаботыПользователей
	СоединенияИБКлиент.УстановитьКонтрольРежимаЗавершенияРаботыПользователей();
	// Конец ЗавершениеРаботыПользователей
	
	СформироватьОтчеты();

	ПроверитьПодключениеОбработчикаОжидания(Истина);

	// Проверка заполнения констант валют учетов
	Если НЕ ЗначениеЗаполнено(глЗначениеПеременной("ВалютаРегламентированногоУчета")) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнена константа валюты регламентированного учета!");
	КонецЕсли;
	Если НЕ ЗначениеЗаполнено(глЗначениеПеременной("ВалютаУправленческогоУчета")) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнена константа валюты управленческого учета!");
	КонецЕсли;
	Если Метаданные.Константы.Найти("ВалютаМеждународногоУчета") <> Неопределено 
		И НЕ ЗначениеЗаполнено(глЗначениеПеременной("ВалютаМеждународногоУчета")) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не заполнена константа валюты международного учета!");
	КонецЕсли;


	ВключенИнтерфейсКассира = Ложь;
	УправлениеРозничнойТорговлей.ЗапускИнтерфейсаКассира(глЗначениеПеременной("глТекущийПользователь"), ВключенИнтерфейсКассира, ПолучитьСерверТО());

	// Если интерфейс кассира включен - эти действия выполнять не нужно.
	Если НЕ ВключенИнтерфейсКассира Тогда
		
		//Если ПравоДоступа("Использование", Метаданные.Обработки.АвтоПолучениеОтправкаЭлектронныхПисем) Тогда
		//	глОбработкаАвтоПолученияОтправкиЭлектронныхПисем = Обработки.АвтоПолучениеОтправкаЭлектронныхПисем.ПолучитьФорму();
		//КонецЕсли; 
		
		Если Не ВосстановитьЗначение("ОбзорКонфигурации_ПоказыватьПриСтарте") = Ложь Тогда
			Обработки.ОбзорКонфигурации.ПолучитьФорму().Открыть();
		КонецЕсли;         
		
		Если УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "АвтооткрытиеМенеджераКонтактовПриЗапускеПрограммы") = Истина Тогда
			Если ПравоДоступа("Использование", Метаданные.Обработки.МенеджерКонтактов) Тогда
				Обработки.МенеджерКонтактов.ПолучитьФорму().Открыть();
			Иначе
				ОбщегоНазначения.Сообщение("Недостаточно прав доступа к обработке ""Менеджер контактов"". Обратитесь к администратору пользователей.", Перечисления.ВидыСообщений.ВажнаяИнформация);
			КонецЕсли; 
		КонецЕсли; 

		Если УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "АвтооткрытиеФормыРабочегоМестаМенеджераПоПродажамПриЗапускеПрограммы") = Истина Тогда
			Если ПравоДоступа("Использование", Метаданные.Обработки.РабочееМестоМенеджераПоПродажам) Тогда
				Обработки.РабочееМестоМенеджераПоПродажам.ПолучитьФорму().Открыть();
			Иначе
				ОбщегоНазначения.Сообщение("Недостаточно прав доступа к обработке ""Рабочее место менеджера по продажам"". Обратитесь к администратору пользователей.", Перечисления.ВидыСообщений.ВажнаяИнформация);
			КонецЕсли; 
		КонецЕсли;
		
		Попытка
			Если ПравоДоступа("ИнтерактивноеОткрытиеВнешнихОбработок", Метаданные) Тогда 
				Путеводитель = Справочники.ВнешниеОбработки.НайтиПоНаименованию("Путеводитель по демонстрационной базе");
				Если Путеводитель <> Справочники.ВнешниеОбработки.ПустаяСсылка() И Не ВосстановитьЗначение("ПутеводительПоДемоБазе_ПоказыватьПриСтарте") = Ложь Тогда
					Попытка
						ИмяФайла = ПолучитьИмяВременногоФайла("epf");
						ДвоичныеДанные = Путеводитель.ХранилищеВнешнейОбработки.Получить();
						ДвоичныеДанные.Записать(ИмяФайла);
						Форма = ВнешниеОбработки.ПолучитьФорму(ИмяФайла);
						Если Не Форма = Неопределено Тогда
							Форма.Открыть();
						КонецЕсли;
						УдалитьФайлы(ИмяФайла);
					Исключение
					КонецПопытки;  				
				КонецЕсли; 
			КонецЕсли;	
		Исключение
		КонецПопытки;
		
		ЭтоФайловаяИБ = ОпределитьЭтаИнформационнаяБазаФайловая();
		
		Если ЭтоФайловаяИБ Тогда
						
			ПользовательДляВыполненияРеглЗаданий = Константы.ПользовательДляВыполненияРегламентныхЗаданийВФайловомВарианте.Получить();
			
			Если глЗначениеПеременной("глТекущийПользователь") = ПользовательДляВыполненияРеглЗаданий Тогда
				
				// с интервалом секунд вызываем процедуру работы с регламентными заданиями
				ПоддержкаРегламентныхЗаданиеДляФайловойВерсии();
				
				ИнтервалДляОпроса = Константы.ИнтервалДляОпросаРегламентныхЗаданийВФайловомВарианте.Получить();
				
				Если ИнтервалДляОпроса = Неопределено
					ИЛИ ИнтервалДляОпроса = 0 Тогда
					
					ИнтервалДляОпроса = 60;	
					
				КонецЕсли;
				
				ПодключитьОбработчикОжидания("ПоддержкаРегламентныхЗаданиеДляФайловойВерсии", ИнтервалДляОпроса);
				
			КонецЕсли;
			
		КонецЕсли;

		Если глЗначениеПеременной("глОбработкаАвтоОбменДанными") <> Неопределено Тогда
			// подключим обработчик обменов данными
			ПодключитьОбработчикОжидания("ПроверкаОбменаДанными", глЗначениеПеременной("глКоличествоСекундОпросаОбмена"));
		КонецЕсли;
		
	КонецЕсли;
	
	НачатьПроверкуДинамическогоОбновленияИБ();

	
	
	Если УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ЗагружатьАктуальныеКурсыВалютПриЗапускеСистемы") Тогда
		// Автоматическая загрузка курсов валют
		ЗначениеКонстанты = Константы.НастройкиЗагрузкиКурсовВалют.Получить();
		Настройки 		  = ЗначениеКонстанты.Получить();
		ЗагружатьЕжедневно = Ложь;	
		Если Настройки <> Неопределено Тогда
			Попытка
				ЗагружатьЕжедневно = Настройки.ЗагружатьЕжедневно;
			Исключение
			КонецПопытки;	
		КонецЕсли;
		
		Попытка
			Если ЗагружатьЕжедневно Тогда
				ОбработкаЗагрузкаКурсов = Обработки.ЗагрузкаКурсовВалют.Создать();
				Если НЕ ОбработкаЗагрузкаКурсов.КодДоступаАктуален() Тогда
					ФормаОжиданияКурсов = ОбработкаЗагрузкаКурсов.ПолучитьФорму("ФормаОжидания");
					ФормаОжиданияКурсов.Открыть();
					ПодключитьОбработчикОжидания("ОбработчикЗагрузкаКурсов", 20, Истина);
				Иначе
					ОбработкаЗагрузкаКурсов.ЗагрузитьКурсыПоНастройкам();
				КонецЕсли;
				
			КонецЕсли;
		Исключение
		КонецПопытки;
	КонецЕсли;

	Если РольДоступна("ПолныеПрава") ИЛИ РольДоступна("ИспользованиеТорговогоОборудования") Тогда
		мКлиентOnline = Обработки.ТОКлиентККМOnline.Создать();
		мКлиентOnline.НачатьРаботу();
	КонецЕсли;
	
	
	ПолучитьВнешниеКомпонентыПриНеобходимости();
	
	// Календарь бухгалтера. Регламентированная отчетность.
	ПроверитьНапоминанияКалендарьБухгалтераСобытия();
	
	// Открытие дополнительной информации
	Форма = Обработки.ДополнительнаяИнформация.ПолучитьФорму("ФормаРабочийСтол");
	Форма.Открыть();
	
	// ОбновлениеКонфигурации
	ОбновлениеКонфигурацииКлиент.ПроверитьОбновлениеКонфигурации();	
	// Конец ОбновлениеКонфигурации
	
	Если УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ОткрыватьПриЗапускеСписокТекущихЗадачПользователя") Тогда
		Задачи.ЗадачаИсполнителя.ПолучитьФормуСписка().Открыть();
	КонецЕсли;
	
	
	//Добавление обязательных значений в кеш ОбщиеЗначения
	РаботаСОбщимиПеременными.ДобавитьОбязательныеЗначенияВКэш();
	
	//РаботаСВнешнимОборудованием
	МенеджерОборудованияКлиент.ПриНачалеРаботыСистемы();
	//Конец РаботаСВнешнимОборудованием
	
	Если УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "АвтооткрытиеУниверсальногоЖурналаДокументов") = Истина Тогда
		Обработки.УниверсальныйЖурналДокументов.ПолучитьФорму().Открыть();
	КонецЕсли;

	глПодключитьМенеджерЗвит1С(Ложь);
	
КонецПроцедуры

// Перед завершением работы системы
//
Процедура ПередЗавершениемРаботыСистемы(Отказ)
	
	ЗапрашиватьПотверждение = 
		ПропуститьПредупреждениеПередЗавершениемРаботыСистемы <> Истина
		И глЗначениеПеременной("глЗапрашиватьПодтверждениеПриЗакрытии") <> Ложь
		И УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ЗапрашиватьПодтверждениеПриЗакрытии") = Истина;
	
	Если ЗапрашиватьПотверждение Тогда
		Ответ = Вопрос("Завершить работу с программой?", РежимДиалогаВопрос.ДаНет);
		Отказ = (Ответ = КодВозвратаДиалога.Нет);
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	// отдельно получаем настройки для которых нужно выполнить обмен при выходе из программы
	ПроцедурыОбменаДанными.ВыполнитьОбменПриЗавершенииРаботыПрограммы(глЗначениеПеременной("глОбработкаАвтоОбменДанными"));
		
	//РаботаСВнешнимОборудованием
	МенеджерОборудованияКлиент.ПередЗавершениемРаботыСистемы();
	//Конец РаботаСВнешнимОборудованием

	Если Не Отказ И глМенеджерЗвит1С <> Неопределено Тогда
		глМенеджерЗвит1С.ЗавершитьЗвит1С(Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Процедура осуществляет обработку события "При завершении работы системы".
// Данное событие возникает перед завершением работы в режиме 1С:Предприятие
// после закрытия главного окна.
// В данной процедуре могут быть выполнены действия, необходимые при выходе
// из программы.
// Примечание:
// В данной процедуре не допускаются открытие форм и других окон, не
// поддерживаются выдача сообщений, установка текста в панели состояния,
// а также другие действия, требующие наличия главного окна.
//
// Параметры:
//  Нет.
//
Процедура ПриЗавершенииРаботыСистемы()

	Если мКлиентOnline <> Неопределено Тогда
		мКлиентOnline.ЗавершитьРаботу();
	КонецЕсли;
	
	// Показ финальной дополнительной информации
	Форма = Обработки.ДополнительнаяИнформация.Создать();
	Форма.ВыполнитьДействие();

КонецПроцедуры // ПриЗавершенииРаботыСистемы()

// Процедура - обработчик внешнего событие, которое возникает при посылке
// внешним приложением сообщения, сформированного в специальном формате.
// Внешнее событие сначала обрабатывается всеми открытыми формами, имеющими
// обработчик этого события, а затем может быть обработано в данной процедуре.
//
// Параметры:
//  Источник - <Строка>
//           - Источник внешнего события.
//
//  Событие  - <Строка>
//           - Наименование события.
//
//  Данные   - <Строка>
//           - Данные для события.
//
Процедура ОбработкаВнешнегоСобытия(Источник, Событие, Данные)

	Если Источник = "Zvit1C" Тогда
		
		// Актуализируем глМенеджерЗвит1С, если был подключен как внешний
		Если Не глПодключитьМенеджерЗвит1С() Тогда
			Возврат;
		КонецЕсли;

		глМенеджерЗвит1С.ОбработкаВнешнегоСобытияЗвит1С(Источник, Событие, Данные);	
		
	Иначе
		
		Если мКлиентOnline <> Неопределено Тогда
			мКлиентOnline.ВнешнееСобытие(Источник, Событие, Данные);
		КонецЕсли;

		ПолучитьСерверТО().ЗавершитьОбработкуВнешнегоСобытия(Источник, Событие, Данные);
		
	КонецЕсли;

КонецПроцедуры // ВнешнееСобытие()

////////////////////////////////////////////////////////////////////////////////
// ЭКСПОРТНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура проверяет Напоминания
//
Процедура ПроверитьНапоминания() Экспорт
	
	УправлениеКонтактами.ПроверитьНапоминанияПользователя(глЗначениеПеременной("глТекущийПользователь"));
	
КонецПроцедуры

// ПроверитьНапоминанияПользователяКалендарьБухгалтераСобытия
//
Процедура ПроверитьНапоминанияКалендарьБухгалтераСобытия() Экспорт
КонецПроцедуры // ПроверитьНапоминанияПользователяКалендарьБухгалтераСобытия

// Процедура проверяет и при необходимости подключает обработчик ожидания
// на запуск процедуры ПроверитьНапоминания()
//
// Параметры:
//  Нет.
//
Процедура ПроверитьПодключениеОбработчикаОжидания(ПроверятьДеньРождения = Ложь) Экспорт
	
	ИнтервалПроверкиНапоминанийВСекундах = Константы.ИнтервалПроверкиНапоминанийВСекундах.Получить();
	
	Если глЗначениеПеременной("глТекущийПользователь") <> Неопределено
		 И ТипЗнч(глЗначениеПеременной("глТекущийПользователь")) = Тип("СправочникСсылка.Пользователи")
		 И НЕ глЗначениеПеременной("глТекущийПользователь").Пустая()
		 И УправлениеПользователями.ПолучитьЗначениеПоУмолчанию(глЗначениеПеременной("глТекущийПользователь"), "ИспользоватьНапоминания")
		 И ИнтервалПроверкиНапоминанийВСекундах > 0 Тогда
		 
		ПодключитьОбработчикОжидания("ПроверитьНапоминания", ИнтервалПроверкиНапоминанийВСекундах);

		УправлениеКонтактами.ПроверитьНапоминанияПользователя(глЗначениеПеременной("глТекущийПользователь"), ПроверятьДеньРождения);

	Иначе
		
		ОтключитьОбработчикОжидания("ПроверитьНапоминания");
		
	КонецЕсли; 
	
КонецПроцедуры

// Процедура осуществляет проверку на необходимость обмена данными с заданным интервалом
Процедура ПроверкаОбменаДанными() Экспорт

	Если глЗначениеПеременной("глОбработкаАвтоОбменДанными") = Неопределено Тогда
		Возврат;
	КонецЕсли;		
	
	ОтключитьОбработчикОжидания("ПроверкаОбменаДанными");
	
	// проводим обмен данными
	глЗначениеПеременной("глОбработкаАвтоОбменДанными").ПровестиОбменДанными(); 
		
	ПодключитьОбработчикОжидания("ПроверкаОбменаДанными", глЗначениеПеременной("глКоличествоСекундОпросаОбмена"));


КонецПроцедуры


// Открывает форму текущего пользователя для изменения его настроек.
//
// Параметры:
//  Нет.
//
Процедура ОткрытьФормуТекущегоПользователя() Экспорт

	Если НЕ ЗначениеЗаполнено(глЗначениеПеременной("глТекущийПользователь")) Тогда
		ОбщегоНазначения.СообщитьОбОшибке("Не задан текущий пользователь.");
	Иначе
		Форма = глЗначениеПеременной("глТекущийПользователь").ПолучитьФорму();
		Форма.Открыть();
	КонецЕсли;

КонецПроцедуры // ОткрытьФормуТекущегоПользователя()

// Функция вызова формы редактирования настройки файла обновления конфигурации
//
Процедура ОткрытьФормуРедактированияНастройкиФайлаОбновления() Экспорт
	
	Если НЕ ПравоДоступа("Чтение", Метаданные.Константы.НастройкаФайлаОбновленияКонфигурации) Тогда
		
		Предупреждение("Нет прав на чтение данных константы ""Настройка файла обновления конфигурации""", 30, "Настройка файла обновления конфигурации");		
		Возврат;
		
	КонецЕсли;

	ФормаРедактирования = ПолучитьОбщуюФорму("НастройкаФайлаОбновленияКонфигурации");
	ФормаРедактирования.СтруктураПараметров = ПроцедурыОбменаДанными.ПолучитьНастройкиДляФайлаОбновленияКонфигурации(); 
	ФормаРедактирования.Открыть();
	
КонецПроцедуры

// Процедура служит для поддержки работы регламентных заданий в файловой версии
//
Процедура ПоддержкаРегламентныхЗаданиеДляФайловойВерсии() Экспорт
	
	ВыполнитьОбработкуЗаданий();
	
КонецПроцедуры

// Функция возвращает объект для взаимодействия с торговым оборудованием.
//
// Параметры:
//  Нет.
//
// Возвращаемое значение:
//  <ОбработкаОбъект> - Объект для взаимодействия с торговым оборудованием.
//
Функция ПолучитьСерверТО() Экспорт

	Если глСерверТО = Неопределено Тогда
		глСерверТО = Обработки.ТОСервер.Создать();
	КонецЕсли;

	Возврат глСерверТО;

КонецФункции // ПолучитьСерверТО()


////////////////////////////////////////////////////////////////////////////////
// ВСПОМОГАТЕЛЬНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ

// Процедура подключает внешние компоненты, которые поставляются с конфигурацией.
//
Процедура ПолучитьВнешниеКомпонентыПриНеобходимости()
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВнешниеКомпоненты.ИмяФайла,
	|	ВнешниеКомпоненты.ДатаИзмененияФайла
	|ИЗ
	|	РегистрСведений.ВнешниеКомпоненты КАК ВнешниеКомпоненты";
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Файл = Новый Файл(КаталогПрограммы()+ Выборка.ИмяФайла);
		
		Если Не Файл.Существует() Или Не Файл.ПолучитьВремяИзменения() = Выборка.ДатаИзмененияФайла Тогда
			НаборЗаписей = РегистрыСведений.ВнешниеКомпоненты.СоздатьНаборЗаписей();
			НаборЗаписей.Отбор.ИмяФайла.Установить(Выборка.ИмяФайла);
			НаборЗаписей.Прочитать();
			
			Попытка
				НаборЗаписей[0].ХранилищеФайла.Получить().Записать(КаталогПрограммы()+ Выборка.ИмяФайла);
				Файл = Новый Файл(КаталогПрограммы()+ Выборка.ИмяФайла);
				Файл.УстановитьВремяИзменения(Выборка.ДатаИзмененияФайла);
			Исключение
			КонецПопытки;
			
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры // ПолучитьВнешниеКомпонентыПриНеобходимости()

// Обработать параметр запуска программы.
// Реализация функции может быть расширена для обработки новых параметров.
//
// Параметры
//  ПараметрЗапуска  – Строка – параметр запуска, переданный в конфигурацию 
//								с помощью ключа командной строки /C.
//
// Возвращаемое значение:
//   Булево   – Истина, если необходимо прервать выполнение процедуры ПриНачалеРаботыСистемы.
//
Функция ОбработатьПараметрыЗапуска(Знач ПараметрЗапуска)

	// есть ли параметры запуска
	Если ПустаяСтрока(ПараметрЗапуска) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	// Параметр может состоять из частей, разделенных символом ";".
	// Первая часть - главное значение параметра запуска. 
	// Наличие дополнительных частей определяется логикой обработки главного параметра.
	ПараметрыЗапуска = ОбщегоНазначения.РазложитьСтрокуВМассивПодстрок(ПараметрЗапуска,";");
	ЗначениеПараметраЗапуска = Врег(ПараметрыЗапуска[0]);
	
	Результат = СоединенияИБКлиент.ОбработатьПараметрыЗапуска(ЗначениеПараметраЗапуска, ПараметрыЗапуска);
	Возврат Результат;

КонецФункции 

// Процедура выполняет запуск отчетов, у которых установлен признак "Формировать при входе в систему"
//
Процедура СформироватьОтчеты()

	ВыбраннаяНастройка = ВосстановитьЗначение("ОбработкаРапортРуководителю_Настройки");
	Если НЕ ВыбраннаяНастройка = Неопределено Тогда
		
		Параметры = Неопределено;
		Если ВыбраннаяНастройка.Свойство("_ДанныеФормы", Параметры) Тогда
			АвтоЗапуск = Неопределено;
			Параметры.Свойство("ФормироватьПриСтартеСистемы", АвтоЗапуск);
			Если НЕ АвтоЗапуск = Неопределено И АвтоЗапуск Тогда
				НовыйОтчет = Отчеты.РапортРуководителю.Создать();
				НовыйОтчетФорма = НовыйОтчет.ПолучитьФорму("ФормаГлавная");
				НовыйОтчетФорма.НачальноеЗначениеВыбора = Истина;
				НовыйОтчетФорма.Открыть();
			КонецЕсли;
		КонецЕсли;
		
	КонецЕсли;

КонецПроцедуры


Процедура ОбработчикЗагрузкаКурсов() Экспорт
	
	Если НЕ ФормаОжиданияКурсов = Неопределено Тогда
		Если ФормаОжиданияКурсов.Открыта() Тогда
			ФормаОжиданияКурсов.Закрыть();
			ФормаОжиданияКурсов = Неопределено;
			#Если Клиент Тогда
				ЗапуститьПриложение("http://finance.ua/ru/price/~/1c");
			#КонецЕсли	
			ОбработкаЗагрузкаКурсов = Обработки.ЗагрузкаКурсовВалют.Создать();
			ОбработкаЗагрузкаКурсов.ЗагрузитьКурсыПоНастройкам();
		КонецЕсли; 
		ФормаОжиданияКурсов = Неопределено;
	КонецЕсли;
	
КонецПроцедуры

// Подключить актуальный менеджер 1С:Звіт
//
Функция глПодключитьМенеджерЗвит1С(ВыводитьСообщенияОбОшибках = Истина) Экспорт
	
	ИсточникОтчета = "РегламентированныйОтчетМенеджерЗвит1С";
	
	Если глМенеджерЗвит1С <> Неопределено Тогда
		
		// Проверим, был ли подключен/переподключен внешний менеджер 1С:Звіт		
		Если РегламентированнаяОтчетность.ВерсияРеглОтчетаАктуальна(ИсточникОтчета) = Истина Тогда
			Возврат Истина;
		КонецЕсли;
		
	Иначе
		ПравоДоступаКОтчету = РегламентированнаяОтчетность.ПравоДоступаКРегламентированномуОтчету(ИсточникОтчета);
		Если ПравоДоступаКОтчету = Ложь ИЛИ ПравоДоступаКОтчету = Неопределено Тогда
			
			Если ВыводитьСообщенияОбОшибках Тогда                                                                                                                            
				Предупреждение(НСтр("ru='Недостаточно прав на использование модуля взаимодействия с ""1С:Звіт""!';uk='Недостатньо прав на використання модуля взаємодії зі ""1С:Звіт""!'"));
			КонецЕсли;			
			Возврат Ложь;
			
		КонецЕсли;
		
	КонецЕсли;
	
	МенеджерЗвит1С = РегламентированнаяОтчетность.РеглОтчеты(ИсточникОтчета);
	
	Если МенеджерЗвит1С = Неопределено Тогда
		Если ВыводитьСообщенияОбОшибках Тогда
			Сообщить(НСтр("ru='Не удалось получить менеджер ""1С:Звіт""!';uk='Не вдалося отримати менеджер ""1С:Звіт""!'"), СтатусСообщения.Важное);
			// Возможно это ошибка для которой детальная информация не должна выводиться
			// выведем ее принудительно
			НайденныйЭлемент = РегламентированнаяОтчетность.ПолучитьРеглОтчетПоУмолчанию(ИсточникОтчета);
			Если НайденныйЭлемент = Справочники.РегламентированныеОтчеты.ПустаяСсылка() Тогда
				Сообщить(НСтр("ru='В справочнике ""Регламентированные отчеты"" не найден менеджер по работе с системой ""1С:Звіт""';uk='У довіднику ""Регламентовані звіти"" не знайдено менеджер по роботі з системою ""1С:Звіт""'"));
			КонецЕсли;
			
		КонецЕсли;
		
		Если глМенеджерЗвит1С <> Неопределено Тогда
			
			Если ВыводитьСообщенияОбОшибках Тогда                                                                                                                            
				Сообщить(НСтр("ru='Будет использован уже загруженный менеджер';uk='Буде використаний вже завантажений менеджер'"), СтатусСообщения.Информация);
			КонецЕсли;
			Возврат Истина;
			
		КонецЕсли;
		
		Возврат Ложь;
		
	КонецЕсли;
	
	Если ТипЗнч(МенеджерЗвит1С) = Тип("ОтчетМенеджер.РегламентированныйОтчетМенеджерЗвит1С") Тогда
		МенеджерЗвит1С = МенеджерЗвит1С.Создать();
	КонецЕсли;
	
	Если глМенеджерЗвит1С = Неопределено Тогда
		
		// Обновляем глобальную переменную сразу для поддержки новых конфигураций с старым внешним менеджером 1С:Звіт
		глМенеджерЗвит1С = МенеджерЗвит1С;
		
		Если Не глМенеджерЗвит1С.Инициализация(ВыводитьСообщенияОбОшибках) Тогда		
			глМенеджерЗвит1С = Неопределено;
			Возврат Ложь;	
		КонецЕсли;
		
	Иначе
		Попытка
			
			Если Не МенеджерЗвит1С.Переинициализация(ВыводитьСообщенияОбОшибках, глМенеджерЗвит1С) Тогда		
				Если ВыводитьСообщенияОбОшибках Тогда                                                                                                                            
					Сообщить(НСтр("ru='Будет использован уже загруженный менеджер';uk='Буде використаний вже завантажений менеджер'"), СтатусСообщения.Информация);
				КонецЕсли;
				Возврат Истина;
				
			КонецЕсли;
			
			глМенеджерЗвит1С = МенеджерЗвит1С;
			
		Исключение
			
			// Если остался устаревший менеджер 1С:Звіт. То в нем нет метода Переинициализация(...)
			Если ВыводитьСообщенияОбОшибках Тогда                                                                                                                            
				Сообщить(НСтр("ru = 'Не удалось переподключить менеджер ""1С:Звіт"". 
                                     |Необходимо обновить менеджер 1С:Звіт в справочнике ""Регламентированные отчеты""'; uk = 'Не вдалося перепідключити менеджер ""1С:Звіт"".
                                     |Необхідно оновити менеджер 1С:Звіт в довіднику ""Регламентовані звіти""'"), СтатусСообщения.Важное);
				Сообщить(НСтр("ru='Будет использован уже загруженный менеджер';uk='Буде використаний вже завантажений менеджер'"), СтатусСообщения.Информация);			
			КонецЕсли;
			Возврат Истина;
			
		КонецПопытки;
		
	КонецЕсли;
		
	Возврат Истина;
	
КонецФункции

