
&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Элементы.ТекстСообщения.Заголовок = Параметры.ТекстСообщения;
	Если Параметры.ЗавершитьРаботу Тогда
		Элементы.ФормаНет.Видимость = Ложь;
	КонецЕсли;
	
	Если Параметры.ДопустимаяВерсия Тогда
		Элементы.ФормаЗавершитьРаботу.Видимость = Ложь;
		Элементы.ФормаЗавершитьРаботу.КнопкаПоУмолчанию = Ложь;
		Элементы.ФормаНет.КнопкаПоУмолчанию = Истина;
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ПродолжитьРаботу(Команда)
	
	Закрыть(КодВозвратаДиалога.Отмена);
	
КонецПроцедуры

&НаКлиенте
Процедура ЗавершитьРаботу(Команда)
	
	Закрыть(КодВозвратаДиалога.ОК);
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстСсылкиНажатие(Элемент)
	СтандартнаяОбработка = Ложь;
	ЗапуститьПриложение("http://releases.1c.eu");
КонецПроцедуры
