//////////////////////////////////////////////////////////////////////////////////////////
// Обработчики событий формы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ОписаниеОбновлений.Очистить();
	ОписаниеОбновлений.Вывести(ОписаниеИзмененийСистемы.ДокументОписаниеОбновлений(Параметры.СтартоваяВерсия));
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОбновленийВыбор(Элемент, Область, СтандартнаяОбработка)
	
	ОбновлениеИнформационнойБазыКлиентПереопределяемый.ПриНажатииНаГиперссылкуВДокументеОписанияОбновлений(Область);
	
КонецПроцедуры

&НаКлиенте
Процедура ОписаниеОбновленийОбработкаРасшифровки(Элемент, Расшифровка, СтандартнаяОбработка)
	
	Если ТипЗнч(Расшифровка) = Тип("Форма") Тогда
		// В расшифровке может содержаться какая-либо форма.
		СтандартнаяОбработка = Ложь;
		Расшифровка.Открыть();
	КонецЕсли;
	
КонецПроцедуры
